assets/pages/syllabus.org
#+SETUPFILE: ../org-themes/readtheorg_inline.theme
#+EXPORT_FILE_NAME: ../../static/pages/syllabus/index.html
#+OPTIONS: broken-links:t
#+TITLE: Syllabus

Some meta ideas about learning:
- [[https://docs.google.com/spreadsheets/d/1E4bMpdD41MkWbeSHduRxeBzqWuULEzwyLb2RjeQIFHE/edit#gid=1946927248][Personal OKR]] 🐽


* [#A] Writing
** Reading list
- [[https://www.ribbonfarm.com/series/narrativium/][Narrativium]]
- [[https://saylordotorg.github.io/text_handbook-for-writers/][Handbook for Writers - Table of Contents]]
- [[https://github.com/matheusfelipeog/beautiful-docs][matheusfelipeog/beautiful-docs]]
- [[https://criticalreading.com/][Critical Reading and Writing]]
** Videos
** Blog-posts
- [[https://gordonbrander.com/pattern/storytelling/][Storytelling — Gordon Brander]]
- [[https://danielbmarkham.com/how-to-win-at-tech-publishing/][How To Win At Tech Publishing]]
- [[https://bastian.rieck.me/blog/posts/2022/neal_stephenson/][We Are All Nerds: The Literary Works of Neal Stephenson]]
- [[https://documentation.divio.com/][Documentation System]]
- [[https://diataxis.fr/][Diátaxis]]
- [[https://billwadge.com/2022/03/10/tech-talks-dont-have-to-be-boring-follow-these-simple-rules/][Tech Talks Don’t Have to be Boring; follow these simple rules. {3000 views} |...]]
- [[https://github.com/hackergrrl/art-of-readme][hackergrrl/art-of-readme]]
- [[https://lucasfcosta.com/2021/10/14/my-writing-routine.html][My productivity routine to write a 500-page book]]
- [[https://dynomight.net/lists/][How I learned to stop worrying and structure all writing as a list]]
- [[https://archive.is/jIyAz][In defence of summaries: A response to Iain McGilchrist's critique]]
- [[https://twitter.com/david_perell/status/1394703236335013889][idea river]]
- [[https://andregarzia.com/2021/04/writing-a-technical-book.html][Writing a Technical Book • AndreGarzia.com]]
- [[https://perell.com/essay/the-ultimate-guide-to-writing-online/][The Ultimate Guide to Writing Online - David Perell]]
- [[https://www.downes.ca/cgi-bin/page.cgi?post=38526][How to Write Articles and Essays Quickly]]
- [[https://www.hillelwayne.com/post/cheatsheets/][A Better Cheatsheet • Hillel Wayne]]
* [#A] Web Technologies
** Books
- [[https://hypermedia.systems/][Building Hypermedia Systems]]
** Blog-posts
- Security
- General
  - [[https://github.com/pazguille/offline-first][pazguille/offline-first]]
  - [[https://idlewords.com/talks/website_obesity.htm][The Website Obesity Crisis]]
  - [[https://macwright.com/2020/05/10/spa-fatigue.html][Second-guessing the modern web - macwright.com]]
- HTTP
- API
  - [[https://news.ycombinator.com/item?id=35211171][Real-Time Video Processing with WebCodecs and Streams | Hacker News]]
- Browsers
  - [[https://macwright.com/2022/03/04/browsers-and-files.html][Using files with browsers, in reality - macwright.com]]
** Tools
- [[https://github.com/styfle/breaking-changes-web][styfle/breaking-changes-web: 💢 A list of breaking changes]]
* [#A] Data Structures and Algorithms
