static/syllabus.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-28 Tue 02:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Syllabus</title>
<meta name="author" content="Hrishikesh Barman" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Syllabus</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfa0ec3d">1. Writing</a>
<ul>
<li><a href="#org89ab951">1.1. Reading list</a></li>
<li><a href="#orgefd9f3f">1.2. Videos</a></li>
<li><a href="#org0a25036">1.3. Blog-posts</a></li>
</ul>
</li>
<li><a href="#orgcfc5c36">2. Web Technologies</a>
<ul>
<li><a href="#orgd6335d3">2.1. Books</a></li>
<li><a href="#org26e34ae">2.2. Blog-posts</a></li>
<li><a href="#orgb25de1c">2.3. Tools</a></li>
</ul>
</li>
<li><a href="#org9aaaf76">3. Data Structures and Algorithms</a>
<ul>
<li><a href="#org8b791a2">3.1. Books</a></li>
<li><a href="#org27211ee">3.2. Lectures</a></li>
<li><a href="#org7cdd7b5">3.3. Blog-posts</a></li>
<li><a href="#orgdd8a2d3">3.4. Tools</a></li>
</ul>
</li>
<li><a href="#orgdff13fb">4. Math</a>
<ul>
<li><a href="#org8bb2165">4.1. Meta</a></li>
<li><a href="#org3d36669">4.2. Statistics</a>
<ul>
<li><a href="#orgcee2bd7">4.2.1. Lectures</a></li>
<li><a href="#org015fab2">4.2.2. Books</a></li>
<li><a href="#orgf11fc1c">4.2.3. Tools/Helpers</a></li>
<li><a href="#orgb8a0ea9">4.2.4. Blog-posts</a></li>
</ul>
</li>
<li><a href="#org646e592">4.3. Discrete Math</a>
<ul>
<li><a href="#org62b4a91">4.3.1. Books</a></li>
</ul>
</li>
<li><a href="#orga63ba03">4.4. Number Theory</a>
<ul>
<li><a href="#org5ac261a">4.4.1. Books</a></li>
<li><a href="#org7f751db">4.4.2. Blog-posts</a></li>
</ul>
</li>
<li><a href="#orgf11a1f2">4.5. Calculus</a>
<ul>
<li><a href="#orgf8fab46">4.5.1. Books</a></li>
<li><a href="#orgd011512">4.5.2. Lectures</a></li>
<li><a href="#orgf1af950">4.5.3. Blog-posts</a></li>
</ul>
</li>
<li><a href="#org959a467">4.6. Differential Equations</a>
<ul>
<li><a href="#org65a161f">4.6.1. Lectures</a></li>
</ul>
</li>
<li><a href="#org9c02670">4.7. Linear Algebra</a>
<ul>
<li><a href="#orga85de72">4.7.1. Book</a></li>
<li><a href="#orgf68b457">4.7.2. Blog-posts</a></li>
<li><a href="#orgd48bbce">4.7.3. Tools/Helpers</a></li>
</ul>
</li>
<li><a href="#org28c187e">4.8. Real Analysis</a>
<ul>
<li><a href="#org7047d6c">4.8.1. Book</a></li>
</ul>
</li>
<li><a href="#orgcf1887e">4.9. Complex Analysis</a>
<ul>
<li><a href="#orged7cea6">4.9.1. Book</a></li>
<li><a href="#org76268bb">4.9.2. Blog-post</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6f3fcb6">5. Distributed Systems</a>
<ul>
<li><a href="#org9d70d78">5.1. Lectures</a></li>
<li><a href="#org60bb767">5.2. Books</a></li>
<li><a href="#orga375b0f">5.3. Blog-posts</a></li>
<li><a href="#org5e26c9a">5.4. Tools</a></li>
<li><a href="#orgdd331fd">5.5. Others</a></li>
</ul>
</li>
<li><a href="#org6a600e5">6. Business</a>
<ul>
<li><a href="#org2ecd71e">6.1. Blog-posts</a></li>
</ul>
</li>
<li><a href="#org9a46f4c">7. Database</a>
<ul>
<li><a href="#org3a89a67">7.1. Practice</a></li>
<li><a href="#org62bb14f">7.2. Books</a></li>
<li><a href="#org3fd9a7e">7.3. Lectures</a></li>
<li><a href="#org474c46d">7.4. Tools</a></li>
<li><a href="#org4af2e28">7.5. Blog-posts</a></li>
</ul>
</li>
<li><a href="#org251fb4d">8. Information,Thinking and Learning</a>
<ul>
<li><a href="#org8d78344">8.1. Reading list</a></li>
<li><a href="#orgccc9440">8.2. Books/Wikis</a></li>
<li><a href="#org7fed2df">8.3. Blog-posts</a></li>
<li><a href="#org50b466d">8.4. Tools</a></li>
</ul>
</li>
<li><a href="#org0132f51">9. Climate change</a>
<ul>
<li><a href="#org32332df">9.1. Blog posts</a></li>
</ul>
</li>
<li><a href="#org6af230c">10. Data Analysis</a>
<ul>
<li><a href="#orgeda57f9">10.1. Blog-posts</a></li>
<li><a href="#org1a76e53">10.2. Case Studies</a></li>
<li><a href="#orgba0e399">10.3. Datasets</a></li>
<li><a href="#orgbe67164">10.4. Inspirations</a></li>
<li><a href="#org49e8130">10.5. Tools</a></li>
<li><a href="#org60f64be">10.6. Random links</a></li>
<li><a href="#org2b24726">10.7. Books</a></li>
</ul>
</li>
<li><a href="#org0baf777">11. Machine Learning</a>
<ul>
<li><a href="#orgd08688f">11.1. Reading lists</a></li>
<li><a href="#org7e5f184">11.2. Blogposts</a></li>
<li><a href="#orge773e54">11.3. Tools</a></li>
</ul>
</li>
<li><a href="#org9a0b47c">12. Map and Geography</a>
<ul>
<li><a href="#org2df0f61">12.1. Blog-posts</a></li>
<li><a href="#orgd3c9fdd">12.2. Others</a></li>
<li><a href="#org043378c">12.3. Tools</a></li>
</ul>
</li>
<li><a href="#orgccdab99">13. Compilers, Interpreters and PLT</a>
<ul>
<li><a href="#org5e3071c">13.1. Meta</a></li>
<li><a href="#orgdd1c866">13.2. Lectures</a></li>
<li><a href="#org9452672">13.3. Books</a></li>
<li><a href="#org74a37ad">13.4. Blog-posts</a></li>
<li><a href="#orgde2f190">13.5. Tools</a></li>
</ul>
</li>
<li><a href="#orgd8f26c4">14. Security</a>
<ul>
<li><a href="#orgf25b600">14.1. Lectures</a></li>
<li><a href="#org6a3fa90">14.2. Book</a></li>
<li><a href="#org026d83d">14.3. Tools</a></li>
<li><a href="#org4b979b5">14.4. Blog-posts</a></li>
</ul>
</li>
<li><a href="#org6dd8ff6">15. Network</a>
<ul>
<li><a href="#org883fe66">15.1. Meta</a></li>
<li><a href="#org7e697b4">15.2. Books</a></li>
<li><a href="#org6725ad7">15.3. Blog-posts</a></li>
</ul>
</li>
<li><a href="#orgf955db8">16. Finance and Economics</a>
<ul>
<li><a href="#org39e7c25">16.1. Lectures</a></li>
<li><a href="#org4bc0174">16.2. Videos</a></li>
<li><a href="#org6ebba28">16.3. Blog-posts</a></li>
<li><a href="#orgcb5fe7b">16.4. Others</a></li>
</ul>
</li>
<li><a href="#orgc3bba70">17. Computer Architecture</a>
<ul>
<li><a href="#orge6eb1cb">17.1. Lectures</a></li>
</ul>
</li>
<li><a href="#org91915eb">18. Operating Systems and Kernel</a>
<ul>
<li><a href="#org8a6bb3e">18.1. Reading list</a></li>
<li><a href="#org36c56d0">18.2. Lectures</a></li>
<li><a href="#orgc713216">18.3. Books</a></li>
<li><a href="#orgd81a3cd">18.4. Blog-posts</a></li>
</ul>
</li>
<li><a href="#org1df9ca2">19. Creative Programming</a>
<ul>
<li><a href="#orge6c5f6a">19.1. Blog-posts</a></li>
<li><a href="#org7b6d4dd">19.2. Others</a></li>
<li><a href="#org690dd0d">19.3. Reading lists</a></li>
<li><a href="#org1d30b60">19.4. Courses</a></li>
<li><a href="#orgc81cbb5">19.5. Tools</a></li>
</ul>
</li>
<li><a href="#org6962b8a">20. Archival</a>
<ul>
<li><a href="#org6042e2a">20.1. Blog-posts</a></li>
<li><a href="#org59a36eb">20.2. Reading lists</a></li>
</ul>
</li>
<li><a href="#org3640cc0">21. General Software Engineering</a>
<ul>
<li><a href="#org7771007">21.1. Meta</a></li>
<li><a href="#org31949ac">21.2. Tactical</a></li>
<li><a href="#org1c2bc7d">21.3. Engineering Management</a></li>
<li><a href="#org0e3a692">21.4. Freelancing</a></li>
<li><a href="#org578a8d9">21.5. Process</a></li>
<li><a href="#org6e6e66c">21.6. Interviews and Job market</a></li>
<li><a href="#orgc7c9dc9">21.7. Handbooks/Resources</a></li>
<li><a href="#org32fc033">21.8. Software research</a></li>
</ul>
</li>
<li><a href="#org2fe01f5">22. Embedded systems and Radio</a>
<ul>
<li><a href="#org30cbb89">22.1. Radio</a></li>
<li><a href="#org8f0a3c2">22.2. FPGA</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Some meta ideas about learning:
</p>
<ul class="org-ul">
<li><a href="https://docs.google.com/spreadsheets/d/1E4bMpdD41MkWbeSHduRxeBzqWuULEzwyLb2RjeQIFHE/edit#gid=1946927248">Personal OKR</a> 🐽</li>
</ul>


<div id="outline-container-orgfa0ec3d" class="outline-2">
<h2 id="orgfa0ec3d"><span class="section-number-2">1.</span> Writing</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org89ab951" class="outline-3">
<h3 id="org89ab951"><span class="section-number-3">1.1.</span> Reading list</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="https://www.ribbonfarm.com/series/narrativium/">Narrativium</a></li>
<li><a href="https://saylordotorg.github.io/text_handbook-for-writers/">Handbook for Writers - Table of Contents</a></li>
<li><a href="https://github.com/matheusfelipeog/beautiful-docs">matheusfelipeog/beautiful-docs</a></li>
<li><a href="https://criticalreading.com/">Critical Reading and Writing</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgefd9f3f" class="outline-3">
<h3 id="orgefd9f3f"><span class="section-number-3">1.2.</span> Videos</h3>
</div>
<div id="outline-container-org0a25036" class="outline-3">
<h3 id="org0a25036"><span class="section-number-3">1.3.</span> Blog-posts</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="https://gordonbrander.com/pattern/storytelling/">Storytelling — Gordon Brander</a></li>
<li><a href="https://danielbmarkham.com/how-to-win-at-tech-publishing/">How To Win At Tech Publishing</a></li>
<li><a href="https://bastian.rieck.me/blog/posts/2022/neal_stephenson/">We Are All Nerds: The Literary Works of Neal Stephenson</a></li>
<li><a href="https://documentation.divio.com/">Documentation System</a></li>
<li><a href="https://diataxis.fr/">Diátaxis</a></li>
<li><a href="https://billwadge.com/2022/03/10/tech-talks-dont-have-to-be-boring-follow-these-simple-rules/">Tech Talks Don’t Have to be Boring; follow these simple rules. {3000 views} |&#x2026;</a></li>
<li><a href="https://github.com/hackergrrl/art-of-readme">hackergrrl/art-of-readme</a></li>
<li><a href="https://lucasfcosta.com/2021/10/14/my-writing-routine.html">My productivity routine to write a 500-page book</a></li>
<li><a href="https://dynomight.net/lists/">How I learned to stop worrying and structure all writing as a list</a></li>
<li><a href="https://archive.is/jIyAz">In defence of summaries: A response to Iain McGilchrist&rsquo;s critique</a></li>
<li><a href="https://twitter.com/david_perell/status/1394703236335013889">idea river</a></li>
<li><a href="https://andregarzia.com/2021/04/writing-a-technical-book.html">Writing a Technical Book • AndreGarzia.com</a></li>
<li><a href="https://perell.com/essay/the-ultimate-guide-to-writing-online/">The Ultimate Guide to Writing Online - David Perell</a></li>
<li><a href="https://www.downes.ca/cgi-bin/page.cgi?post=38526">How to Write Articles and Essays Quickly</a></li>
<li><a href="https://www.hillelwayne.com/post/cheatsheets/">A Better Cheatsheet • Hillel Wayne</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgcfc5c36" class="outline-2">
<h2 id="orgcfc5c36"><span class="section-number-2">2.</span> Web Technologies</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd6335d3" class="outline-3">
<h3 id="orgd6335d3"><span class="section-number-3">2.1.</span> Books</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="https://hypermedia.systems/">Building Hypermedia Systems</a></li>
</ul>
</div>
</div>
<div id="outline-container-org26e34ae" class="outline-3">
<h3 id="org26e34ae"><span class="section-number-3">2.2.</span> Blog-posts</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Security</li>
<li>General
<ul class="org-ul">
<li><a href="https://github.com/pazguille/offline-first">pazguille/offline-first</a></li>
<li><a href="https://idlewords.com/talks/website_obesity.htm">The Website Obesity Crisis</a></li>
<li><a href="https://macwright.com/2020/05/10/spa-fatigue.html">Second-guessing the modern web - macwright.com</a></li>
</ul></li>
<li>HTTP</li>
<li>API
<ul class="org-ul">
<li><a href="https://news.ycombinator.com/item?id=35211171">Real-Time Video Processing with WebCodecs and Streams | Hacker News</a></li>
</ul></li>
<li>Browsers
<ul class="org-ul">
<li><a href="https://macwright.com/2022/03/04/browsers-and-files.html">Using files with browsers, in reality - macwright.com</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb25de1c" class="outline-3">
<h3 id="orgb25de1c"><span class="section-number-3">2.3.</span> Tools</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><a href="https://github.com/styfle/breaking-changes-web">styfle/breaking-changes-web: 💢 A list of breaking changes</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9aaaf76" class="outline-2">
<h2 id="org9aaaf76"><span class="section-number-2">3.</span> Data Structures and Algorithms</h2>
<div class="outline-text-2" id="text-3">
</div>
