assets/pages/syllabus.org
** Books
- [[https://go-compression.github.io/][The Hitchhiker's Guide to Compression]]
** Lectures
** Blog-posts
- [[https://github.com/mkirchner/linked-list-good-taste][mkirchner/linked-list-good-taste]]
- [[https://ketansingh.me/posts/lets-talk-skiplist/][Let's talk SkipList]]
- [[https://austinhenley.com/blog/challengingalgorithms.html][Challenging algorithms and data structures every programmer should try]]
** Tools
- [[https://www.cs.usfca.edu/~galles/visualization/Algorithms.html][Data Structure Visualization]]
- [[https://github.com/jhackshaw/tspvis][jhackshaw/tspvis: Visualize]]
- [[https://github.com/gzc/CLRS][gzc/CLRS: Solutions to Introduction to Algorithms]]
* [#A] Math
** Meta
- [[http://blog.pkh.me/p/29-the-most-useful-math-formulas.html][The most useful math formulas]]
** Statistics
*** Lectures
*** Books
*** Tools/Helpers
*** Blog-posts
- [[https://hollymathnerd.medium.com/how-to-defend-yourself-from-statistical-lies-fe0227ecc3f3][How to Defend Yourself From Statistical Lies: Master Post | by holly, a math ...]]
- [[https://www.johnmyleswhite.com/notebook/2013/03/22/modes-medians-and-means-an-unifying-perspective/][Modes, Medians and Means: A Unifying Perspective · John Myles White]]
- [[https://towardsdatascience.com/statistical-tests-when-to-use-which-704557554740][Statistical Tests — When to use Which ? | by vibhor nigam | Towards Data Science]]
** Discrete Math
*** Books
- [[https://github.com/liuxinyu95/unplugged][liuxinyu95/unplugged: Open book about math and programming.]]
** Number Theory
*** Books
*** Blog-posts
- [[https://beza1e1.tuxen.de/no_real_numbers.html][No real numbers]]
- [[https://www.codechef.com/wiki/tutorial-number-theory/#][Basic Number Theory Every Programmer Should Know... | CodeChef]]
- [[https://artofproblemsolving.com/wiki/index.php/Modular_arithmetic/Introduction][Art of Problem Solving Modular Arithmetic]]
- [[https://www.youtube.com/playlist?list=PLYZlcsMwMhDxsNMktNFkZymK8V6dzGDhB][Lecture on Modular Arithmetic - YouTube]]
** Calculus
*** Books
- [[https://calculusmadeeasy.org/][Calculus Made Easy]]
*** Lectures
- [[https://ocw.mit.edu/courses/res-18-005-highlights-of-calculus-spring-2010/][Highlights of Calculus | Supplemental Resources | MIT OpenCourseWare]]
- [[https://www.youtube.com/watch?v=WUvTyaaNkzM&list=PLZHQObOWTQDMsr9K-rj53DwVRMYO3t5Yr][The essence of calculus - YouTube]]
*** Blog-posts
- [[https://wordsandbuttons.online/sine_and_cosine.html][Sine and cosine]]
** Differential Equations
*** Lectures
- [[https://www.khanacademy.org/math/differential-equations][Differential Equations | Khan Academy]]
- [[https://ocw.mit.edu/courses/res-18-009-learn-differential-equations-up-close-with-gilbert-strang-and-cleve-moler-fall-2015/][Learn Differential Equations: Up Close with Gilbert Strang and Cleve Moler]]
- [[https://www.youtube.com/watch?v=p_di4Zn4wz4&list=PLZHQObOWTQDNPOjrT6KVlfJuKtYTftqH6][Differential equations, a tourist's guide | DE1 - YouTube]]
** Linear Algebra
*** Book
- [[https://hefferon.net/linearalgebra/][Free Linear Algebra textbook, from Jim Hefferon]]
*** Blog-posts
*** Tools/Helpers
- [[https://algebrarules.com/][Algebrarules.com: The Most Useful Rules of Basic Algebra]]
** Real Analysis
*** Book
- [[https://www.goodreads.com/book/show/845794.Understanding_Analysis?ac=1&from_search=true&qid=piqDzi6FKd&rank=1][Understanding Analysis by Stephen Abbott]]
** Complex Analysis
*** Book
- [[https://www.goodreads.com/book/show/202444.Complex_Analysis?ac=1&from_search=true&qid=ZiX4Ah46EL&rank=1][Complex Analysis by Joseph Bak]]
*** Blog-post
- [[https://acko.net/blog/how-to-fold-a-julia-fractal/][How to Fold a Julia Fractal — Acko.net]]
- [[https://robjlow.blogspot.com/2017/06/what-is-this-thing-called-i.html][Shiny Pebbles and other stuff: What is this thing called i?]]

* [#A] Distributed Systems
** Lectures
- [[https://news.ycombinator.com/item?id=33071119][The Fundamentals of Control Theory | Hacker News]]
** Books
