static/syllabus.html
<div id="outline-container-org8b791a2" class="outline-3">
<h3 id="org8b791a2"><span class="section-number-3">3.1.</span> Books</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="https://go-compression.github.io/">The Hitchhiker&rsquo;s Guide to Compression</a></li>
</ul>
</div>
</div>
<div id="outline-container-org27211ee" class="outline-3">
<h3 id="org27211ee"><span class="section-number-3">3.2.</span> Lectures</h3>
</div>
<div id="outline-container-org7cdd7b5" class="outline-3">
<h3 id="org7cdd7b5"><span class="section-number-3">3.3.</span> Blog-posts</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><a href="https://github.com/mkirchner/linked-list-good-taste">mkirchner/linked-list-good-taste</a></li>
<li><a href="https://ketansingh.me/posts/lets-talk-skiplist/">Let&rsquo;s talk SkipList</a></li>
<li><a href="https://austinhenley.com/blog/challengingalgorithms.html">Challenging algorithms and data structures every programmer should try</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgdd8a2d3" class="outline-3">
<h3 id="orgdd8a2d3"><span class="section-number-3">3.4.</span> Tools</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li><a href="https://www.cs.usfca.edu/~galles/visualization/Algorithms.html">Data Structure Visualization</a></li>
<li><a href="https://github.com/jhackshaw/tspvis">jhackshaw/tspvis: Visualize</a></li>
<li><a href="https://github.com/gzc/CLRS">gzc/CLRS: Solutions to Introduction to Algorithms</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgdff13fb" class="outline-2">
<h2 id="orgdff13fb"><span class="section-number-2">4.</span> Math</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org8bb2165" class="outline-3">
<h3 id="org8bb2165"><span class="section-number-3">4.1.</span> Meta</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><a href="http://blog.pkh.me/p/29-the-most-useful-math-formulas.html">The most useful math formulas</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3d36669" class="outline-3">
<h3 id="org3d36669"><span class="section-number-3">4.2.</span> Statistics</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-orgcee2bd7" class="outline-4">
<h4 id="orgcee2bd7"><span class="section-number-4">4.2.1.</span> Lectures</h4>
</div>
<div id="outline-container-org015fab2" class="outline-4">
<h4 id="org015fab2"><span class="section-number-4">4.2.2.</span> Books</h4>
</div>
<div id="outline-container-orgf11fc1c" class="outline-4">
<h4 id="orgf11fc1c"><span class="section-number-4">4.2.3.</span> Tools/Helpers</h4>
</div>
<div id="outline-container-orgb8a0ea9" class="outline-4">
<h4 id="orgb8a0ea9"><span class="section-number-4">4.2.4.</span> Blog-posts</h4>
<div class="outline-text-4" id="text-4-2-4">
<ul class="org-ul">
<li><a href="https://hollymathnerd.medium.com/how-to-defend-yourself-from-statistical-lies-fe0227ecc3f3">How to Defend Yourself From Statistical Lies: Master Post | by holly, a math &#x2026;</a></li>
<li><a href="https://www.johnmyleswhite.com/notebook/2013/03/22/modes-medians-and-means-an-unifying-perspective/">Modes, Medians and Means: A Unifying Perspective · John Myles White</a></li>
<li><a href="https://towardsdatascience.com/statistical-tests-when-to-use-which-704557554740">Statistical Tests — When to use Which ? | by vibhor nigam | Towards Data Science</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org646e592" class="outline-3">
<h3 id="org646e592"><span class="section-number-3">4.3.</span> Discrete Math</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-org62b4a91" class="outline-4">
<h4 id="org62b4a91"><span class="section-number-4">4.3.1.</span> Books</h4>
<div class="outline-text-4" id="text-4-3-1">
<ul class="org-ul">
<li><a href="https://github.com/liuxinyu95/unplugged">liuxinyu95/unplugged: Open book about math and programming.</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga63ba03" class="outline-3">
<h3 id="orga63ba03"><span class="section-number-3">4.4.</span> Number Theory</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-org5ac261a" class="outline-4">
<h4 id="org5ac261a"><span class="section-number-4">4.4.1.</span> Books</h4>
</div>
<div id="outline-container-org7f751db" class="outline-4">
<h4 id="org7f751db"><span class="section-number-4">4.4.2.</span> Blog-posts</h4>
<div class="outline-text-4" id="text-4-4-2">
<ul class="org-ul">
<li><a href="https://beza1e1.tuxen.de/no_real_numbers.html">No real numbers</a></li>
<li><a href="https://www.codechef.com/wiki/tutorial-number-theory/#">Basic Number Theory Every Programmer Should Know&#x2026; | CodeChef</a></li>
<li><a href="https://artofproblemsolving.com/wiki/index.php/Modular_arithmetic/Introduction">Art of Problem Solving Modular Arithmetic</a></li>
<li><a href="https://www.youtube.com/playlist?list=PLYZlcsMwMhDxsNMktNFkZymK8V6dzGDhB">Lecture on Modular Arithmetic - YouTube</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf11a1f2" class="outline-3">
<h3 id="orgf11a1f2"><span class="section-number-3">4.5.</span> Calculus</h3>
<div class="outline-text-3" id="text-4-5">
</div>
<div id="outline-container-orgf8fab46" class="outline-4">
<h4 id="orgf8fab46"><span class="section-number-4">4.5.1.</span> Books</h4>
<div class="outline-text-4" id="text-4-5-1">
<ul class="org-ul">
<li><a href="https://calculusmadeeasy.org/">Calculus Made Easy</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd011512" class="outline-4">
<h4 id="orgd011512"><span class="section-number-4">4.5.2.</span> Lectures</h4>
<div class="outline-text-4" id="text-4-5-2">
<ul class="org-ul">
<li><a href="https://ocw.mit.edu/courses/res-18-005-highlights-of-calculus-spring-2010/">Highlights of Calculus | Supplemental Resources | MIT OpenCourseWare</a></li>
<li><a href="https://www.youtube.com/watch?v=WUvTyaaNkzM&amp;list=PLZHQObOWTQDMsr9K-rj53DwVRMYO3t5Yr">The essence of calculus - YouTube</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf1af950" class="outline-4">
<h4 id="orgf1af950"><span class="section-number-4">4.5.3.</span> Blog-posts</h4>
<div class="outline-text-4" id="text-4-5-3">
<ul class="org-ul">
<li><a href="https://wordsandbuttons.online/sine_and_cosine.html">Sine and cosine</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org959a467" class="outline-3">
<h3 id="org959a467"><span class="section-number-3">4.6.</span> Differential Equations</h3>
<div class="outline-text-3" id="text-4-6">
</div>
<div id="outline-container-org65a161f" class="outline-4">
<h4 id="org65a161f"><span class="section-number-4">4.6.1.</span> Lectures</h4>
<div class="outline-text-4" id="text-4-6-1">
<ul class="org-ul">
<li><a href="https://www.khanacademy.org/math/differential-equations">Differential Equations | Khan Academy</a></li>
<li><a href="https://ocw.mit.edu/courses/res-18-009-learn-differential-equations-up-close-with-gilbert-strang-and-cleve-moler-fall-2015/">Learn Differential Equations: Up Close with Gilbert Strang and Cleve Moler</a></li>
<li><a href="https://www.youtube.com/watch?v=p_di4Zn4wz4&amp;list=PLZHQObOWTQDNPOjrT6KVlfJuKtYTftqH6">Differential equations, a tourist&rsquo;s guide | DE1 - YouTube</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9c02670" class="outline-3">
<h3 id="org9c02670"><span class="section-number-3">4.7.</span> Linear Algebra</h3>
<div class="outline-text-3" id="text-4-7">
</div>
<div id="outline-container-orga85de72" class="outline-4">
<h4 id="orga85de72"><span class="section-number-4">4.7.1.</span> Book</h4>
<div class="outline-text-4" id="text-4-7-1">
<ul class="org-ul">
<li><a href="https://hefferon.net/linearalgebra/">Free Linear Algebra textbook, from Jim Hefferon</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf68b457" class="outline-4">
<h4 id="orgf68b457"><span class="section-number-4">4.7.2.</span> Blog-posts</h4>
</div>
<div id="outline-container-orgd48bbce" class="outline-4">
<h4 id="orgd48bbce"><span class="section-number-4">4.7.3.</span> Tools/Helpers</h4>
<div class="outline-text-4" id="text-4-7-3">
<ul class="org-ul">
<li><a href="https://algebrarules.com/">Algebrarules.com: The Most Useful Rules of Basic Algebra</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org28c187e" class="outline-3">
<h3 id="org28c187e"><span class="section-number-3">4.8.</span> Real Analysis</h3>
<div class="outline-text-3" id="text-4-8">
</div>
<div id="outline-container-org7047d6c" class="outline-4">
<h4 id="org7047d6c"><span class="section-number-4">4.8.1.</span> Book</h4>
<div class="outline-text-4" id="text-4-8-1">
<ul class="org-ul">
<li><a href="https://www.goodreads.com/book/show/845794.Understanding_Analysis?ac=1&amp;from_search=true&amp;qid=piqDzi6FKd&amp;rank=1">Understanding Analysis by Stephen Abbott</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgcf1887e" class="outline-3">
<h3 id="orgcf1887e"><span class="section-number-3">4.9.</span> Complex Analysis</h3>
<div class="outline-text-3" id="text-4-9">
</div>
<div id="outline-container-orged7cea6" class="outline-4">
<h4 id="orged7cea6"><span class="section-number-4">4.9.1.</span> Book</h4>
<div class="outline-text-4" id="text-4-9-1">
<ul class="org-ul">
<li><a href="https://www.goodreads.com/book/show/202444.Complex_Analysis?ac=1&amp;from_search=true&amp;qid=ZiX4Ah46EL&amp;rank=1">Complex Analysis by Joseph Bak</a></li>
</ul>
</div>
</div>
<div id="outline-container-org76268bb" class="outline-4">
<h4 id="org76268bb"><span class="section-number-4">4.9.2.</span> Blog-post</h4>
<div class="outline-text-4" id="text-4-9-2">
<ul class="org-ul">
<li><a href="https://acko.net/blog/how-to-fold-a-julia-fractal/">How to Fold a Julia Fractal — Acko.net</a></li>
<li><a href="https://robjlow.blogspot.com/2017/06/what-is-this-thing-called-i.html">Shiny Pebbles and other stuff: What is this thing called i?</a></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org6f3fcb6" class="outline-2">
<h2 id="org6f3fcb6"><span class="section-number-2">5.</span> Distributed Systems</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org9d70d78" class="outline-3">
<h3 id="org9d70d78"><span class="section-number-3">5.1.</span> Lectures</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li><a href="https://news.ycombinator.com/item?id=33071119">The Fundamentals of Control Theory | Hacker News</a></li>
</ul>
</div>
</div>
