assets/pages/syllabus.org
** Blog-posts
- General
  - [[https://martinfowler.com/articles/patterns-of-distributed-systems/][Patterns of Distributed Systems]]
  - [[https://archive.is/H62mM][Distributed Systems and the End of the API | The Quilt Project]]
  - [[https://martinfowler.com/articles/patterns-of-distributed-systems/lamport-clock.html][Lamport Clock]]
- Raft
  - [[https://thesquareplanet.com/blog/students-guide-to-raft/][Students' Guide to Raft - Jon Gjengset]]
  - [[https://eli.thegreenplace.net/2020/implementing-raft-part-0-introduction/][Implementing Raft: Part 0 - Introduction - Eli Bendersky's website]]
- CRDTs
  - [[https://news.ycombinator.com/item?id=33764449][CRDT: Fractional Indexing | Hacker News]]
  - [[https://news.ycombinator.com/item?id=33931971][Show HN: Pg_CRDT – an experimental CRDT extension for Postgres | Hacker News]]
  - [[https://news.ycombinator.com/item?id=33865672][You might not need a CRDT | Hacker News]]
- CAP
  - [[https://mwhittaker.github.io/blog/an_illustrated_proof_of_the_cap_theorem/][An Illustrated Proof of the CAP Theorem]]
  - [[http://ksat.me/a-plain-english-introduction-to-cap-theorem][A plain English introduction to CAP theorem « Kaushik Sathupadi]]
- Experiments
  - [[https://www.evilsocket.net/2022/10/20/Reverse-Engineering-the-Apple-MultiPeer-Connectivity-Framework/][Reverse Engineering the Apple MultiPeer Connectivity Framework]]
- Sys Admin
  - [[https://nbailey.ca/post/block-scanners/][Block web scanners with ipset & iptables]]
  - [[https://www.hackerfactor.com/blog/index.php?/archives/762-Attacked-Over-Tor.html][Attacked Over Tor - The Hacker Factor Blog]]
  - [[https://wiki.nftables.org/wiki-nftables/index.php/Moving_from_ipset_to_nftables][Moving from ipset to nftables - nftables wiki]]
- System Design
  - [[https://world.hey.com/joaoqalves/disasters-i-ve-seen-in-a-microservices-world-a9137a51][Disasters I've seen in a microservices world]]
  - [[https://robertovitillo.com/how-distributed-systems-fail/][How distributed systems fail | Roberto Vitillo]]
- P2P
  - [[https://news.ycombinator.com/item?id=34303497][CDC File Transfer | Hacker News]]
** Tools
- [[https://github.com/jepsen-io/maelstrom][jepsen-io/maelstrom: A workbench for writing toy implementations]]
** Others
- [[https://geocar.sdf1.org/fast-servers.html][fast-servers]]
* [#A] Business
** Blog-posts
* [#A] Database
** Practice
- [[https://pgexercises.com/gettingstarted.html][PostgreSQL Exercises]]
** Books
- [[https://www.interdb.jp/pg/pgsql01.html][The Internals of PostgreSQL : Chapter 1 Database Cluster, Databases, and Tables]]
- [[https://sql-performance-explained.com/][SQL Performance Explained: The database tuning book for developers]]
- [[https://use-the-index-luke.com/sql/preface][Who has to add the right indexes to an SQL database?]]
- [[https://www.oreilly.com/library/view/database-internals/9781492040330/][Database Internals]]
** Lectures
- [[https://15721.courses.cs.cmu.edu/spring2019/][CMU 15-721 - Advanced Database Systems (Spring 2019)]]
- [[https://github.com/pingcap/talent-plan][pingcap/talent-plan: open source training courses about distributed]]
** Tools
- Postgres Tools
  - [[https://pgtune.leopard.in.ua/#%2F=][PGTune - calculate configuration for PostgreSQL based on the maximum performace]]
  - [[https://pgstats.dev/][PostgreSQL Observability]]
** Blog-posts
- General
  - [[https://euandre.org/2020/08/31/the-database-i-wish-i-had.html][The database I wish I had - EuAndreh]]
  - [[https://di.nmfay.com/postgres-vs-mysql][the ultimate postgres vs mysql blog post | dian m fay]]
  - [[https://redis.com/blog/legacy-database-migration/][Legacy Database Migration: What To Know Before You Start | Redis]] 
  - [[https://vishnubharathi.codes/blog/paper-notes-key-value-storage-engines/][Paper notes: Key-Value Storage Engines]]
- Working
  - others
    - [[https://www.compileralchemy.com/books/sqlite-internals/][SQLite Internals: How The World's Most Used Database Works]]
    - [[https://cstack.github.io/db_tutorial/][How Does a Database Work? | Let’s Build a Simple Database]]
    - [[https://brunocalza.me/how-buffer-pool-works-an-implementation-in-go/][How Buffer Pool Works: An Implementation In Go]]
- Distributed
  - [[https://martin.kleppmann.com/2015/05/11/please-stop-calling-databases-cp-or-ap.html][Please stop calling databases CP or AP — Martin Kleppmann’s blog]]
  - [[http://_.0xffff.me/dynamodb2022.html][Some notes on DynamoDB 2022 paper]]
- Design and performance
  - [[https://teej.ghost.io/understanding-the-snowflake-query-optimizer/][Understanding the Snowflake Query Optimizer]]
  - [[https://mapdb.org/blog/mapdb_lessons/][Lessons from MapDB development - MapDB]]
  - [[https://www.craigkerstiens.com/2012/10/01/understanding-postgres-performance/][Understanding Postgres Performance - Craig Kerstiens]]
  - [[https://relinx.io/2020/09/14/old-good-database-design/][Old, Good Database Design – Relinx]]
- Other
  - [[https://www.pinecone.io/learn/vector-database/][What is a Vector Database? | Pinecone]]
  - [[https://boredcaveman.xyz/post/0x1_dbless-torrent-website.html][Database-less torrent website with IPFS]]
  - [[https://til.simonwillison.net/clickhouse/github-explorer?s=35][Querying the GitHub archive with the ClickHouse playground | Simon Willison’s...]]

* [#B] Information,Thinking and Learning
