static/syllabus.html
<div id="outline-container-org60bb767" class="outline-3">
<h3 id="org60bb767"><span class="section-number-3">5.2.</span> Books</h3>
</div>
<div id="outline-container-orga375b0f" class="outline-3">
<h3 id="orga375b0f"><span class="section-number-3">5.3.</span> Blog-posts</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>General
<ul class="org-ul">
<li><a href="https://martinfowler.com/articles/patterns-of-distributed-systems/">Patterns of Distributed Systems</a></li>
<li><a href="https://archive.is/H62mM">Distributed Systems and the End of the API | The Quilt Project</a></li>
<li><a href="https://martinfowler.com/articles/patterns-of-distributed-systems/lamport-clock.html">Lamport Clock</a></li>
</ul></li>
<li>Raft
<ul class="org-ul">
<li><a href="https://thesquareplanet.com/blog/students-guide-to-raft/">Students&rsquo; Guide to Raft - Jon Gjengset</a></li>
<li><a href="https://eli.thegreenplace.net/2020/implementing-raft-part-0-introduction/">Implementing Raft: Part 0 - Introduction - Eli Bendersky&rsquo;s website</a></li>
</ul></li>
<li>CRDTs
<ul class="org-ul">
<li><a href="https://news.ycombinator.com/item?id=33764449">CRDT: Fractional Indexing | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=33931971">Show HN: Pg<sub>CRDT</sub> – an experimental CRDT extension for Postgres | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=33865672">You might not need a CRDT | Hacker News</a></li>
</ul></li>
<li>CAP
<ul class="org-ul">
<li><a href="https://mwhittaker.github.io/blog/an_illustrated_proof_of_the_cap_theorem/">An Illustrated Proof of the CAP Theorem</a></li>
<li><a href="http://ksat.me/a-plain-english-introduction-to-cap-theorem">A plain English introduction to CAP theorem « Kaushik Sathupadi</a></li>
</ul></li>
<li>Experiments
<ul class="org-ul">
<li><a href="https://www.evilsocket.net/2022/10/20/Reverse-Engineering-the-Apple-MultiPeer-Connectivity-Framework/">Reverse Engineering the Apple MultiPeer Connectivity Framework</a></li>
</ul></li>
<li>Sys Admin
<ul class="org-ul">
<li><a href="https://nbailey.ca/post/block-scanners/">Block web scanners with ipset &amp; iptables</a></li>
<li><a href="https://www.hackerfactor.com/blog/index.php?/archives/762-Attacked-Over-Tor.html">Attacked Over Tor - The Hacker Factor Blog</a></li>
<li><a href="https://wiki.nftables.org/wiki-nftables/index.php/Moving_from_ipset_to_nftables">Moving from ipset to nftables - nftables wiki</a></li>
</ul></li>
<li>System Design
<ul class="org-ul">
<li><a href="https://world.hey.com/joaoqalves/disasters-i-ve-seen-in-a-microservices-world-a9137a51">Disasters I&rsquo;ve seen in a microservices world</a></li>
<li><a href="https://robertovitillo.com/how-distributed-systems-fail/">How distributed systems fail | Roberto Vitillo</a></li>
</ul></li>
<li>P2P
<ul class="org-ul">
<li><a href="https://news.ycombinator.com/item?id=34303497">CDC File Transfer | Hacker News</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5e26c9a" class="outline-3">
<h3 id="org5e26c9a"><span class="section-number-3">5.4.</span> Tools</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li><a href="https://github.com/jepsen-io/maelstrom">jepsen-io/maelstrom: A workbench for writing toy implementations</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgdd331fd" class="outline-3">
<h3 id="orgdd331fd"><span class="section-number-3">5.5.</span> Others</h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li><a href="https://geocar.sdf1.org/fast-servers.html">fast-servers</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6a600e5" class="outline-2">
<h2 id="org6a600e5"><span class="section-number-2">6.</span> Business</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org2ecd71e" class="outline-3">
<h3 id="org2ecd71e"><span class="section-number-3">6.1.</span> Blog-posts</h3>
</div>
</div>
<div id="outline-container-org9a46f4c" class="outline-2">
<h2 id="org9a46f4c"><span class="section-number-2">7.</span> Database</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org3a89a67" class="outline-3">
<h3 id="org3a89a67"><span class="section-number-3">7.1.</span> Practice</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li><a href="https://pgexercises.com/gettingstarted.html">PostgreSQL Exercises</a></li>
</ul>
</div>
</div>
<div id="outline-container-org62bb14f" class="outline-3">
<h3 id="org62bb14f"><span class="section-number-3">7.2.</span> Books</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li><a href="https://www.interdb.jp/pg/pgsql01.html">The Internals of PostgreSQL : Chapter 1 Database Cluster, Databases, and Tables</a></li>
<li><a href="https://sql-performance-explained.com/">SQL Performance Explained: The database tuning book for developers</a></li>
<li><a href="https://use-the-index-luke.com/sql/preface">Who has to add the right indexes to an SQL database?</a></li>
<li><a href="https://www.oreilly.com/library/view/database-internals/9781492040330/">Database Internals</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3fd9a7e" class="outline-3">
<h3 id="org3fd9a7e"><span class="section-number-3">7.3.</span> Lectures</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li><a href="https://15721.courses.cs.cmu.edu/spring2019/">CMU 15-721 - Advanced Database Systems (Spring 2019)</a></li>
<li><a href="https://github.com/pingcap/talent-plan">pingcap/talent-plan: open source training courses about distributed</a></li>
</ul>
</div>
</div>
<div id="outline-container-org474c46d" class="outline-3">
<h3 id="org474c46d"><span class="section-number-3">7.4.</span> Tools</h3>
<div class="outline-text-3" id="text-7-4">
<ul class="org-ul">
<li>Postgres Tools
<ul class="org-ul">
<li><a href="https://pgtune.leopard.in.ua/#%2F=">PGTune - calculate configuration for PostgreSQL based on the maximum performace</a></li>
<li><a href="https://pgstats.dev/">PostgreSQL Observability</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4af2e28" class="outline-3">
<h3 id="org4af2e28"><span class="section-number-3">7.5.</span> Blog-posts</h3>
<div class="outline-text-3" id="text-7-5">
<ul class="org-ul">
<li>General
<ul class="org-ul">
<li><a href="https://euandre.org/2020/08/31/the-database-i-wish-i-had.html">The database I wish I had - EuAndreh</a></li>
<li><a href="https://di.nmfay.com/postgres-vs-mysql">the ultimate postgres vs mysql blog post | dian m fay</a></li>
<li><a href="https://redis.com/blog/legacy-database-migration/">Legacy Database Migration: What To Know Before You Start | Redis</a></li>
<li><a href="https://vishnubharathi.codes/blog/paper-notes-key-value-storage-engines/">Paper notes: Key-Value Storage Engines</a></li>
</ul></li>
<li>Working
<ul class="org-ul">
<li>mmap
<ul class="org-ul">
<li><a href="https://brunocalza.me/but-how-exactly-databases-use-mmap/">But how, exactly, databases use mmap?</a></li>
<li><a href="https://sasha-f.medium.com/why-mmap-is-faster-than-system-calls-24718e75ab37">Why mmap is faster than system calls</a></li>
<li><a href="https://archive.is/hZ1kc">Pekka Enberg on Twitter: &ldquo;Are memory-mapped files (mmap) faster than syscalls</a></li>
</ul></li>
<li>others
<ul class="org-ul">
<li><a href="https://www.compileralchemy.com/books/sqlite-internals/">SQLite Internals: How The World&rsquo;s Most Used Database Works</a></li>
<li><a href="https://cstack.github.io/db_tutorial/">How Does a Database Work? | Let’s Build a Simple Database</a></li>
<li><a href="https://brunocalza.me/how-buffer-pool-works-an-implementation-in-go/">How Buffer Pool Works: An Implementation In Go</a></li>
</ul></li>
</ul></li>
<li>Distributed
<ul class="org-ul">
<li><a href="https://martin.kleppmann.com/2015/05/11/please-stop-calling-databases-cp-or-ap.html">Please stop calling databases CP or AP — Martin Kleppmann’s blog</a></li>
<li><a href="http://_.0xffff.me/dynamodb2022.html">Some notes on DynamoDB 2022 paper</a></li>
</ul></li>
<li>Design and performance
<ul class="org-ul">
<li><a href="https://teej.ghost.io/understanding-the-snowflake-query-optimizer/">Understanding the Snowflake Query Optimizer</a></li>
<li><a href="https://mapdb.org/blog/mapdb_lessons/">Lessons from MapDB development - MapDB</a></li>
<li><a href="https://www.craigkerstiens.com/2012/10/01/understanding-postgres-performance/">Understanding Postgres Performance - Craig Kerstiens</a></li>
<li><a href="https://relinx.io/2020/09/14/old-good-database-design/">Old, Good Database Design – Relinx</a></li>
</ul></li>
<li>Other
<ul class="org-ul">
<li><a href="https://www.pinecone.io/learn/vector-database/">What is a Vector Database? | Pinecone</a></li>
<li><a href="https://boredcaveman.xyz/post/0x1_dbless-torrent-website.html">Database-less torrent website with IPFS</a></li>
<li><a href="https://til.simonwillison.net/clickhouse/github-explorer?s=35">Querying the GitHub archive with the ClickHouse playground | Simon Willison’s&#x2026;</a></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org251fb4d" class="outline-2">
<h2 id="org251fb4d"><span class="section-number-2">8.</span> Information,Thinking and Learning</h2>
<div class="outline-text-2" id="text-8">
</div>
