assets/pages/syllabus.org
** Reading list
- [[https://withorbit.com/][Orbit]]
- [[http://www.idc.iitb.ac.in/][IDC School of Design, Indian Institute of Technology Bombay(IIT Bombay), India]]
- [[https://notes.azlen.me/g3tibyfv/][About these notes]]
- [[https://hyperlink.academy/courses][hyperlink.academy]]
- [[https://futuretextpublishing.com/][Future Text Publishing]]
- [[https://notes.andymatuschak.org/%C2%A7Note-writing_systems][§Note-writing systems]]
- [[https://every.to/superorganizers][Superorganizers - Every]]
- [[https://www.inkandswitch.com/][Ink & Switch]] 🌟🌟
- [[http://www.aaronsw.com/weblog/rawnerve][Raw Nerve (Aaron Swartz's Raw Thought)]]
- [[https://www.gwern.net/][Essays · Gwern.net]]
- [[https://en.wikipedia.org/wiki/List_of_eponymous_laws][List of eponymous laws - Wikipedia]]
- [[https://www.lesswrong.com/][LessWrong]]
- [[https://github.com/vmbrasseur/Public_Speaking][vmbrasseur/Public_Speaking]]
- [[https://github.com/andytudhope/APerspectiveOnTechnology][andytudhope/APerspectiveOnTechnology]] : collection of the thoughts of programming luminaries of our generation.
- [[https://archive.is/fc8B7][Tools, Computing and Research Labs]] 🌟
- [[https://github.com/k-qy/notation][k-qy/notation: Collection of quotes on notation design]]
- [[https://github.com/chobeat/awesome-critical-tech-reading-list][A Critical Reading list on Tech && (Politics × Society × Ethics)]]
- [[http://cyborganthropology.com/Main_Page][Cyborg Anthropology]]
** Books/Wikis
- [[https://myndmess.miraheze.org/wiki/Main_Page][myndmess]]
- [[https://saylordotorg.github.io/text_organizational-behavior-v1.1/index.html][Organizational Behavior]]
- [[https://introtcs.org/public/][Introduction to Theoretical Computer Science]]
- [[https://www.ludism.org/mentat/HomePage][Mentat Wiki: Home Page]]
