static/syllabus.html
<div id="outline-container-org8d78344" class="outline-3">
<h3 id="org8d78344"><span class="section-number-3">8.1.</span> Reading list</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li><a href="https://withorbit.com/">Orbit</a></li>
<li><a href="http://www.idc.iitb.ac.in/">IDC School of Design, Indian Institute of Technology Bombay(IIT Bombay), India</a></li>
<li><a href="https://notes.azlen.me/g3tibyfv/">About these notes</a></li>
<li><a href="https://hyperlink.academy/courses">hyperlink.academy</a></li>
<li><a href="https://futuretextpublishing.com/">Future Text Publishing</a></li>
<li><a href="https://notes.andymatuschak.org/%C2%A7Note-writing_systems">§Note-writing systems</a></li>
<li><a href="https://every.to/superorganizers">Superorganizers - Every</a></li>
<li><a href="https://www.inkandswitch.com/">Ink &amp; Switch</a> 🌟🌟</li>
<li><a href="http://www.aaronsw.com/weblog/rawnerve">Raw Nerve (Aaron Swartz&rsquo;s Raw Thought)</a></li>
<li><a href="https://www.gwern.net/">Essays · Gwern.net</a></li>
<li><a href="https://en.wikipedia.org/wiki/List_of_eponymous_laws">List of eponymous laws - Wikipedia</a></li>
<li><a href="https://www.lesswrong.com/">LessWrong</a></li>
<li><a href="https://github.com/vmbrasseur/Public_Speaking">vmbrasseur/Public<sub>Speaking</sub></a></li>
<li><a href="https://github.com/andytudhope/APerspectiveOnTechnology">andytudhope/APerspectiveOnTechnology</a> : collection of the thoughts of programming luminaries of our generation.</li>
<li><a href="https://archive.is/fc8B7">Tools, Computing and Research Labs</a> 🌟</li>
<li><a href="https://github.com/k-qy/notation">k-qy/notation: Collection of quotes on notation design</a></li>
<li><a href="https://github.com/chobeat/awesome-critical-tech-reading-list">A Critical Reading list on Tech &amp;&amp; (Politics × Society × Ethics)</a></li>
<li><a href="http://cyborganthropology.com/Main_Page">Cyborg Anthropology</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgccc9440" class="outline-3">
<h3 id="orgccc9440"><span class="section-number-3">8.2.</span> Books/Wikis</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li><a href="https://myndmess.miraheze.org/wiki/Main_Page">myndmess</a></li>
<li><a href="https://saylordotorg.github.io/text_organizational-behavior-v1.1/index.html">Organizational Behavior</a></li>
<li><a href="https://introtcs.org/public/">Introduction to Theoretical Computer Science</a></li>
<li><a href="https://www.ludism.org/mentat/HomePage">Mentat Wiki: Home Page</a></li>
</ul>
</div>
</div>
