assets/pages/syllabus.org
** Blog-posts
- Guides
  - [[https://winnielim.org/experiments/learning/designing-a-self-directed-learning-network-work-in-progress-v0-1/][Winnie Lim » Designing a self-directed learning network: work-in-progress v0.1]]
  - [[https://ncase.me/remember/][How To Remember Anything Forever-ish]]
  - [[https://ai.stanford.edu/blog/introduction-to-knowledge-graphs/][An Introduction to Knowledge Graphs | SAIL Blog]]
  - [[https://johnwickerson.wordpress.com/2019/08/08/block-diagrams/][How to draw block diagrams – Wickopedia]]
- Mental models
  - [[https://nesslabs.com/metacognition][Metacognition: how to think about thinking - Ness Labs]]
  - [[https://www.collaborativefund.com/blog/a-few-rules/][A Few Rules · Collaborative Fund]] 🌟
  - [[https://jane.flowers/computation-becomes-geometry?s=35][The One Who Puts Things In Order]]
  - [[https://www.collaborativefund.com/blog/100-little-ideas/][100 Little Ideas · Collaborative Fund]]
  - [[https://fronterablog.com/mental-model-examples-and-their-explanations/][35+ Mental Model Examples and Their Explanations - Frontera]]
- Experiments
  - [[https://lobste.rs/s/ep44fv/tag_systems][Tag Systems | Lobsters]]
  - [[https://beepb00p.xyz/annotating.html#paper][How to annotate literally everything | beepb00p]]
  - [[https://jacobjackson.com/searching-for-style/][Searching for Style | Jacob Jackson]]
  - [[https://esoteric.codes/][Esoteric.Codes: Esolangs, Esoteric Programming Styles, Code Art, Code Poetry]]
  - [[https://en.wikipedia.org/wiki/Wikipedia:Wikipedia_is_an_MMORPG][Wikipedia:Wikipedia is an MMORPG - Wikipedia]]
  - [[https://numinous.productions/timeful/][Timeful Texts]]
  - [[https://ciechanow.ski/gears/][Gears – Bartosz Ciechanowski]]
  - [[https://drossbucket.com/2021/06/30/hacker-news-folk-wisdom-on-visual-programming/][Hacker News folk wisdom on visual programming – drossbucket]]
  - [[https://news.ycombinator.com/item?id=24638756][Ask HN: Teaching kids how to think?]]
  - [[https://paulbricman.com/thoughtware/semantica][Semantica - Paul Bricman]]
  - [[https://longnow.org/essays/richard-feynman-connection-machine/][Richard Feynman and The Connection Machine - The Long Now]]
- Systems Thinking
  - [[https://medium.com/a-parede/cheat-sheet-for-a-non-or-less-colonialist-speculative-design-9a6b4ae3c465][Cheat Sheet for a Non- (or Less-) Colonialist Speculative Design]]
  - [[https://thesystemisdown.substack.com/p/how-to-win-at-risk-every-time-by?s=r][How To Win At Risk By Using Systems Thinking]]
  - [[https://thesystemsthinker.com/nurturing-systemic-wisdom-through-knowledge-ecology/][Nurturing Systemic Wisdom Through Knowledge Ecology]]
  - [[https://thesystemsthinker.com/a-lifetime-of-systems-thinking/][A Lifetime of Systems Thinking]]
- Others
  - [[https://www.netmeister.org/blog/the-art-of-plain-text.html][The Art of Plain Text]]
  - [[https://www.juliensobczak.com/inspect/2022/05/30/anki-srs.html][Anki SRS Algorithm]]
  - [[https://borretti.me/article/unbundling-tools-for-thought][Unbundling Tools for Thought]]
  - [[https://www.1000hoursoutside.com/blog/time-with-kids-before-age-12][75% of the Time We Spend With Our Kids in Our Lifetime Will Be Spent By Age 12]]
  - [[https://ctmucommunity.org/wiki/][CTMU Wiki]]
  - [[https://maggieappleton.com/programming-portals][Programming Portals]]
  - [[https://github.com/jbrew/readability][GitHub - jbrew/readability: A collection of readability measures]]
  - [[http://worrydream.com/refs/Latour%20-%20Visualisation%20and%20Cognition.pdf]]
  - [[https://web.archive.org/web/20170425043224/http://www.princeton.edu/~hos/h593/20thcent.fin.wp.html]]
  - [[https://web.archive.org/web/20200328132050/https://www.princeton.edu/~hos/Mahoney/cra/cra.html][What Was the Question?]]
  - [[https://pron.github.io/posts/computation-logic-algebra-pt1#primary-sources][Finite of Sense and Infinite of Thought: A History of Computation, Logic and ...]]
  - [[https://rtnf.my.id/wiki-osm][Open Knowledge Movement : Personal Reflections]]
  - [[https://fs.blog/map-and-territory/][The Map Is Not the Territory - Farnam Street]]
  - [[https://howaboutthis.substack.com/p/the-information-that-wont-fit-inside][The Information That Won’t Fit Inside Your Head Part 3]]
  - [[https://www.bramadams.dev/projects/the-danger-of-journaling-is-introspection][The Danger of Journaling IS Introspection - Bram Adams]]
  - [[https://pketh.org/how-i-build.html][How I Build]]
  - [[https://fortelabs.co/blog/para/][The PARA Method: A Universal System for Organizing Digital Information]]
  - [[https://hapgood.us/2015/10/17/the-garden-and-the-stream-a-technopastoral/amp/][The Garden and the Stream: A Technopastoral – Hapgood]]
  - [[https://en.wikipedia.org/wiki/Transformer%5F%28machine%5Flearning%5Fmodel%29][Transformer (machine learning model) - Wikipedia]]
  - [[https://inlinks.net/p/knowledge-graph-explained/][Google Knowledge Graph Explained - Inlinks]]
  - [[https://github.com/prathyvsh/history-of-logic][prathyvsh/history-of-logic]]
  - [[https://dsebastien.net/blog/2022-04-03-25-years-of-personal-knowledge-management][25+ Years of Personal Knowledge Management. From scattered ideas to networked]]
  - [[https://github.com/e-n-f/if-then-else/blob/master/if-then-else.md][if-then-else/if-then-else.md]]
** Tools
- [[https://blog.jethro.dev/posts/remembrance_agents/][Experimenting with Remembrance Agents · Jethro Kuan]]
- [[https://supermemo.guru/wiki/Piotr_Wozniak][Piotr Wozniak - supermemo.guru]]
- [[https://www.liquidtext.net/?s=35][LiquidText - "PDF Editor with Superpowers" FastCompany]]
- [[https://github.com/andymatuschak/orbit][andymatuschak/orbit: Experimental spaced repetition platform for exp...]]
- [[https://www.system.com/graph][System Graphg]]
- [[https://github.com/ncase/loopy][ncase/loopy: A tool for thinking in systems]]
- [[https://untools.co/][Tools for better thinking | Untools]]  : better make a backup of this site, has the info up nicely
- [[http://hint.fm/projects/wordtree/][Word Tree / Fernanda Viegas & Martin Wattenberg]]
- [[https://engineeringmedia.com/][Engineering Media]]
- [[https://github.com/penrose/penrose][penrose/penrose: Create beautiful diagrams just by typing]]
* Climate change
** Blog posts
- [[https://www.prettygoodhouse.org/][Pretty Good House]]
- [[https://archive.is/xxLOU][Yishan on Twitter: "That said, while Iʻm most well-known for my prior work in...]]
* [#B] Data Analysis
