static/syllabus.html
<div id="outline-container-org7fed2df" class="outline-3">
<h3 id="org7fed2df"><span class="section-number-3">8.3.</span> Blog-posts</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>Guides
<ul class="org-ul">
<li><a href="https://winnielim.org/experiments/learning/designing-a-self-directed-learning-network-work-in-progress-v0-1/">Winnie Lim » Designing a self-directed learning network: work-in-progress v0.1</a></li>
<li><a href="https://ncase.me/remember/">How To Remember Anything Forever-ish</a></li>
<li><a href="https://ai.stanford.edu/blog/introduction-to-knowledge-graphs/">An Introduction to Knowledge Graphs | SAIL Blog</a></li>
<li><a href="https://johnwickerson.wordpress.com/2019/08/08/block-diagrams/">How to draw block diagrams – Wickopedia</a></li>
</ul></li>
<li>Mental models
<ul class="org-ul">
<li><a href="https://nesslabs.com/metacognition">Metacognition: how to think about thinking - Ness Labs</a></li>
<li><a href="https://www.collaborativefund.com/blog/a-few-rules/">A Few Rules · Collaborative Fund</a> 🌟</li>
<li><a href="https://jane.flowers/computation-becomes-geometry?s=35">The One Who Puts Things In Order</a></li>
<li><a href="https://www.collaborativefund.com/blog/100-little-ideas/">100 Little Ideas · Collaborative Fund</a></li>
<li><a href="https://fronterablog.com/mental-model-examples-and-their-explanations/">35+ Mental Model Examples and Their Explanations - Frontera</a></li>
</ul></li>
<li>Experiments
<ul class="org-ul">
<li><a href="https://lobste.rs/s/ep44fv/tag_systems">Tag Systems | Lobsters</a></li>
<li><a href="https://beepb00p.xyz/annotating.html#paper">How to annotate literally everything | beepb00p</a></li>
<li><a href="https://jacobjackson.com/searching-for-style/">Searching for Style | Jacob Jackson</a></li>
<li><a href="https://esoteric.codes/">Esoteric.Codes: Esolangs, Esoteric Programming Styles, Code Art, Code Poetry</a></li>
<li><a href="https://en.wikipedia.org/wiki/Wikipedia:Wikipedia_is_an_MMORPG">Wikipedia:Wikipedia is an MMORPG - Wikipedia</a></li>
<li><a href="https://numinous.productions/timeful/">Timeful Texts</a></li>
<li><a href="https://ciechanow.ski/gears/">Gears – Bartosz Ciechanowski</a></li>
<li><a href="https://drossbucket.com/2021/06/30/hacker-news-folk-wisdom-on-visual-programming/">Hacker News folk wisdom on visual programming – drossbucket</a></li>
<li><a href="https://news.ycombinator.com/item?id=24638756">Ask HN: Teaching kids how to think?</a></li>
<li><a href="https://paulbricman.com/thoughtware/semantica">Semantica - Paul Bricman</a></li>
<li><a href="https://longnow.org/essays/richard-feynman-connection-machine/">Richard Feynman and The Connection Machine - The Long Now</a></li>
</ul></li>
<li>Systems Thinking
<ul class="org-ul">
<li><a href="https://medium.com/a-parede/cheat-sheet-for-a-non-or-less-colonialist-speculative-design-9a6b4ae3c465">Cheat Sheet for a Non- (or Less-) Colonialist Speculative Design</a></li>
<li><a href="https://thesystemisdown.substack.com/p/how-to-win-at-risk-every-time-by?s=r">How To Win At Risk By Using Systems Thinking</a></li>
<li><a href="https://thesystemsthinker.com/nurturing-systemic-wisdom-through-knowledge-ecology/">Nurturing Systemic Wisdom Through Knowledge Ecology</a></li>
<li><a href="https://thesystemsthinker.com/a-lifetime-of-systems-thinking/">A Lifetime of Systems Thinking</a></li>
</ul></li>
<li>Others
<ul class="org-ul">
<li><a href="https://www.netmeister.org/blog/the-art-of-plain-text.html">The Art of Plain Text</a></li>
<li><a href="https://www.juliensobczak.com/inspect/2022/05/30/anki-srs.html">Anki SRS Algorithm</a></li>
<li><a href="https://borretti.me/article/unbundling-tools-for-thought">Unbundling Tools for Thought</a></li>
<li><a href="https://www.1000hoursoutside.com/blog/time-with-kids-before-age-12">75% of the Time We Spend With Our Kids in Our Lifetime Will Be Spent By Age 12</a></li>
<li><a href="https://ctmucommunity.org/wiki/">CTMU Wiki</a></li>
<li><a href="https://maggieappleton.com/programming-portals">Programming Portals</a></li>
<li><a href="https://github.com/jbrew/readability">GitHub - jbrew/readability: A collection of readability measures</a></li>
<li><a href="http://worrydream.com/refs/Latour%20-%20Visualisation%20and%20Cognition.pdf">http://worrydream.com/refs/Latour%20-%20Visualisation%20and%20Cognition.pdf</a></li>
<li><a href="https://web.archive.org/web/20170425043224/http://www.princeton.edu/~hos/h593/20thcent.fin.wp.html">https://web.archive.org/web/20170425043224/http://www.princeton.edu/~hos/h593/20thcent.fin.wp.html</a></li>
<li><a href="https://web.archive.org/web/20200328132050/https://www.princeton.edu/~hos/Mahoney/cra/cra.html">What Was the Question?</a></li>
<li><a href="https://pron.github.io/posts/computation-logic-algebra-pt1#primary-sources">Finite of Sense and Infinite of Thought: A History of Computation, Logic and &#x2026;</a></li>
<li><a href="https://rtnf.my.id/wiki-osm">Open Knowledge Movement : Personal Reflections</a></li>
<li><a href="https://fs.blog/map-and-territory/">The Map Is Not the Territory - Farnam Street</a></li>
<li><a href="https://howaboutthis.substack.com/p/the-information-that-wont-fit-inside">The Information That Won’t Fit Inside Your Head Part 3</a></li>
<li><a href="https://www.bramadams.dev/projects/the-danger-of-journaling-is-introspection">The Danger of Journaling IS Introspection - Bram Adams</a></li>
<li><a href="https://pketh.org/how-i-build.html">How I Build</a></li>
<li><a href="https://fortelabs.co/blog/para/">The PARA Method: A Universal System for Organizing Digital Information</a></li>
<li><a href="https://hapgood.us/2015/10/17/the-garden-and-the-stream-a-technopastoral/amp/">The Garden and the Stream: A Technopastoral – Hapgood</a></li>
<li><a href="https://en.wikipedia.org/wiki/Transformer%5F%28machine%5Flearning%5Fmodel%29">Transformer (machine learning model) - Wikipedia</a></li>
<li><a href="https://inlinks.net/p/knowledge-graph-explained/">Google Knowledge Graph Explained - Inlinks</a></li>
<li><a href="https://github.com/prathyvsh/history-of-logic">prathyvsh/history-of-logic</a></li>
<li><a href="https://dsebastien.net/blog/2022-04-03-25-years-of-personal-knowledge-management">25+ Years of Personal Knowledge Management. From scattered ideas to networked</a></li>
<li><a href="https://github.com/e-n-f/if-then-else/blob/master/if-then-else.md">if-then-else/if-then-else.md</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org50b466d" class="outline-3">
<h3 id="org50b466d"><span class="section-number-3">8.4.</span> Tools</h3>
<div class="outline-text-3" id="text-8-4">
<ul class="org-ul">
<li><a href="https://blog.jethro.dev/posts/remembrance_agents/">Experimenting with Remembrance Agents · Jethro Kuan</a></li>
<li><a href="https://supermemo.guru/wiki/Piotr_Wozniak">Piotr Wozniak - supermemo.guru</a></li>
<li><a href="https://www.liquidtext.net/?s=35">LiquidText - &ldquo;PDF Editor with Superpowers&rdquo; FastCompany</a></li>
<li><a href="https://github.com/andymatuschak/orbit">andymatuschak/orbit: Experimental spaced repetition platform for exp&#x2026;</a></li>
<li><a href="https://www.system.com/graph">System Graphg</a></li>
<li><a href="https://github.com/ncase/loopy">ncase/loopy: A tool for thinking in systems</a></li>
<li><a href="https://untools.co/">Tools for better thinking | Untools</a>  : better make a backup of this site, has the info up nicely</li>
<li><a href="http://hint.fm/projects/wordtree/">Word Tree / Fernanda Viegas &amp; Martin Wattenberg</a></li>
<li><a href="https://engineeringmedia.com/">Engineering Media</a></li>
<li><a href="https://github.com/penrose/penrose">penrose/penrose: Create beautiful diagrams just by typing</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0132f51" class="outline-2">
<h2 id="org0132f51"><span class="section-number-2">9.</span> Climate change</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org32332df" class="outline-3">
<h3 id="org32332df"><span class="section-number-3">9.1.</span> Blog posts</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li><a href="https://www.prettygoodhouse.org/">Pretty Good House</a></li>
<li><a href="https://archive.is/xxLOU">Yishan on Twitter: &ldquo;That said, while Iʻm most well-known for my prior work in&#x2026;</a></li>
</ul>
</div>
</div>
</div>
