assets/pages/syllabus.org
** Blog-posts
- [[https://shopify.engineering/shopifys-data-science-engineering-foundations][Shopify's Data Science & Engineering Foundations — Data Science & Engineering]]
- [[https://github.com/xori/gamblers-dice][xori/gamblers-dice: A terrible idea, now real.]]
- [[https://distill.pub/2020/communicating-with-interactive-articles/][Communicating with Interactive Articles]]
- [[https://news.ycombinator.com/item?id=35263115][A eulogy for Dark Sky, a data visualization masterpiece | Hacker News]]
- [[https://www.nu42.com/2015/03/how-you-average-numbers.html][How you average numbers matters]]
- [[https://blog.jpalardy.com/posts/skip-grep-use-awk/][SKIP grep, use AWK | Jonathan Palardy's Blog]]
- [[https://matt.might.net/articles/sculpting-text/][Sculpting text with regex, grep, sed and awk]]
** Case Studies
- [[https://justinkuang.com/projects.html][map projects]]
- [[https://lucasfcosta.com/2021/09/20/monte-carlo-forecasts.html][How to replace estimations and guesses with a Monte Carlo simulation]]
- [[https://github.com/aguaviva/articles/blob/main/why_12_notes.ipynb][articles/why_12_notes.ipynb at main · aguaviva/articles · GitHub]]
- [[https://www.extua.pw/blog/2023/02/25/rental_bike_usage_patterns/][Rental bike usage patterns]]
- [[https://github.com/erikbern/git-of-theseus][GitHub - erikbern/git-of-theseus: Analyze how a Git repo grows over time]]
- [[https://farmsubsidy.org/][Explore European Common Agricultural Policy farm subsidy payments]]
- [[https://news.ycombinator.com/item?id=33711981][Show HN: Visualising real-time Sydney bus congestion with Marey charts]]
- [[https://huyenchip.com/2020/01/18/tech-workers-19k-compensation-details.html][Analysis of compensation, level, and experience details of 19k tech workers]]
- [[https://chan.co.za/how-fateful][How fateful?]]
- [[https://dothemath.ucsd.edu/2022/09/death-by-hockey-sticks/][Death by Hockey Sticks | Do the Math]]
- [[https://github.com/BuzzFeedNews/everything][BuzzFeedNews/everything: An index of all our open-source data]]
- [[https://cheapskatesguide.org/articles/world-internet-prices.html][A Random Sampling of Internet Service Prices around the World]]
- [[https://github.com/aatishb/maskmath][aatishb/maskmath: An Explorable Essay on How Masks Can End COVID-19]]
- Need to download all the images from this tweet by [[https://twitter.com/waitbutwhy/status/1407390418980032528][Tim Urban about graphs/diagrams]]
- [[https://www.yelpeconomicaverage.com/yelp-coronavirus-economic-impact-report.html][Yelp: Local Economic Impact Report]]
- [[https://www.welcomelawfirm.com/blog/where-americans-are-born/][Where Are Americans Born? An Analysis of U.S. Census Data from 1850 - 2020]]
- [[https://news.gallup.com/poll/284009/library-visits-outpaced-trips-movies-2019.aspx][In U.S., Library Visits Outpaced Trips to Movies in 2019]]
- [[https://github.com/platers/MAL-Map][GitHub - platers/MAL-Map: Cluster and visualize relationships between anime o...]]
** Datasets
- [[https://www.benthamsgaze.org/2023/03/01/what-is-synthetic-data-the-good-the-bad-and-the-ugly/][What is Synthetic Data? The Good, the Bad, and the Ugly – Bentham’s Gaze]]
- [[https://news.ycombinator.com/item?id=34935712][Open Airport Map | Hacker News]]
- [[https://news.ycombinator.com/item?id=34630409][Show HN: Groundhog-day.com]]  (See simon's comment)
- [[https://sportsdatabase.com/]]
- Domains
  - [[https://s3-us-west-1.amazonaws.com/umbrella-static/index.html][Cisco Popularity List]]
  - [[https://tranco-list.eu/][A research-oriented top sites ranking hardened against manipulation - Tranco]]
  - [[https://majestic.com/reports/majestic-million][Majestic Million]]
  - https://cdn.smoot.apple.com/static/autofill_tld_whitelist_url
- [[https://news.ycombinator.com/item?id=34558054][The magic of small databases | Hacker News]]
- [[https://cpaproject.in/][Criminal Justice And Police Accountability Project]]
- [[https://dataverse.org/][The Dataverse Project - Dataverse.org]]
- [[https://webdataset.github.io/webdataset/][webdataset]]
- [[https://otd.delhi.gov.in/][Open Transit Data | Delhi]]
- [[https://app.airframes.io/][Airframes]]
- [[https://docs.irail.be/][iRail API Docs]]
- [[https://www.landconflictwatch.org/][Land Conflict Watch]]
- [[https://www.dolthub.com/blog/2022-12-02-open-source-hospital-price-transparency/][Open Source Hospital Price Transparency | DoltHub Blog]]
- [[https://news.ycombinator.com/item?id=26956271][OpenFlights – airport and airline data | Hacker News]]
- [[https://crhallberg.com/cah/][JSON Against Humanity]]
- [[https://news.ycombinator.com/item?id=33346091][Ship Wreck Database | Hacker News]]
- [[https://lobste.rs/s/5guoty/recommendations_thread_your_favorite][Recommendations thread: Your favorite sources of raw data (of any type)]]
- [[https://www.gisgraphy.com/index.php][Open source geocoder and addresses database / POIs database in CSV]]
- https://www.reddit.com/r/datasets/
- [[https://data.worldbank.org/][World Bank Open Data | Data]]
- [[https://www.gharchive.org/][GH Archive]]
- [[https://github.com/awesomedata/awesome-public-datasets][awesomedata/awesome-public-datasets: A topic-centric list]]
- [[https://github.com/tidwall/cities][GitHub - tidwall/cities: 10,000 Cities with Latitude, Longitude, and Elevatio...]]
- [[https://github.com/trustwallet/assets][trustwallet/assets]]: A comprehensive, up-to-date collection of information about several thousands (!) of crypto tokens.
- [[https://github.com/factbook/factbook.json][factbook/factbook.json]]: World Factbook Country Profiles in JSON
- [[https://data.gov.in/][Open Government Data (OGD) Platform India]]
- [[https://ourworldindata.org/internet][Internet - Our World in Data]]
- [[https://github.com/iamcal/emoji-data][GitHub - iamcal/emoji-data: Easy to parse data and spritesheets for emoji]]
- [[https://github.com/dracos/Theatricalia][dracos/Theatricalia: A database of past and future theatre productions]]
- [[https://gitlab.com/CashlessConsumer/data-analysis-notebooks/-/wikis/Payments-System-Data-Dashboard][Payments System Data Dashboard · Wiki · CashlessConsumer / Data Analysis Note...]]
** Inspirations
- [[https://ai-observatory.in/][ai-observatory]]
- [[https://setosa.io/#/][Setosa data visualization and visual explanations]]
- https://www.reddit.com/r/visualization/comments/j6pkw1/a_curated_list_of_epic_realtime_data/
- [[https://www.populationpyramid.net/][Population of WORLD 2019 - PopulationPyramid.net]]
- [[https://informationisbeautiful.net/][Information is Beautiful]]
- [[https://twitter.com/landconflicts]]
- [[https://storywrangling.org/][StoryWrangler - Twitter Ngram Search]]
- [[https://www.reddit.com/r/IndiaSpeaks/comments/nma9oi/network_diagram_of_north_indian_extended_families/][Network diagram of North Indian extended families. Credit: India in Pixels : ...]]
