static/syllabus.html
<div id="outline-container-org6af230c" class="outline-2">
<h2 id="org6af230c"><span class="section-number-2">10.</span> Data Analysis</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgeda57f9" class="outline-3">
<h3 id="orgeda57f9"><span class="section-number-3">10.1.</span> Blog-posts</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li><a href="https://shopify.engineering/shopifys-data-science-engineering-foundations">Shopify&rsquo;s Data Science &amp; Engineering Foundations — Data Science &amp; Engineering</a></li>
<li><a href="https://github.com/xori/gamblers-dice">xori/gamblers-dice: A terrible idea, now real.</a></li>
<li><a href="https://distill.pub/2020/communicating-with-interactive-articles/">Communicating with Interactive Articles</a></li>
<li><a href="https://news.ycombinator.com/item?id=35263115">A eulogy for Dark Sky, a data visualization masterpiece | Hacker News</a></li>
<li><a href="https://www.nu42.com/2015/03/how-you-average-numbers.html">How you average numbers matters</a></li>
<li><a href="https://blog.jpalardy.com/posts/skip-grep-use-awk/">SKIP grep, use AWK | Jonathan Palardy&rsquo;s Blog</a></li>
<li><a href="https://matt.might.net/articles/sculpting-text/">Sculpting text with regex, grep, sed and awk</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1a76e53" class="outline-3">
<h3 id="org1a76e53"><span class="section-number-3">10.2.</span> Case Studies</h3>
<div class="outline-text-3" id="text-10-2">
<ul class="org-ul">
<li><a href="https://justinkuang.com/projects.html">map projects</a></li>
<li><a href="https://lucasfcosta.com/2021/09/20/monte-carlo-forecasts.html">How to replace estimations and guesses with a Monte Carlo simulation</a></li>
<li><a href="https://github.com/aguaviva/articles/blob/main/why_12_notes.ipynb">articles/why<sub>12</sub><sub>notes.ipynb</sub> at main · aguaviva/articles · GitHub</a></li>
<li><a href="https://www.extua.pw/blog/2023/02/25/rental_bike_usage_patterns/">Rental bike usage patterns</a></li>
<li><a href="https://github.com/erikbern/git-of-theseus">GitHub - erikbern/git-of-theseus: Analyze how a Git repo grows over time</a></li>
<li><a href="https://farmsubsidy.org/">Explore European Common Agricultural Policy farm subsidy payments</a></li>
<li><a href="https://news.ycombinator.com/item?id=33711981">Show HN: Visualising real-time Sydney bus congestion with Marey charts</a></li>
<li><a href="https://huyenchip.com/2020/01/18/tech-workers-19k-compensation-details.html">Analysis of compensation, level, and experience details of 19k tech workers</a></li>
<li><a href="https://chan.co.za/how-fateful">How fateful?</a></li>
<li><a href="https://dothemath.ucsd.edu/2022/09/death-by-hockey-sticks/">Death by Hockey Sticks | Do the Math</a></li>
<li><a href="https://github.com/BuzzFeedNews/everything">BuzzFeedNews/everything: An index of all our open-source data</a></li>
<li><a href="https://cheapskatesguide.org/articles/world-internet-prices.html">A Random Sampling of Internet Service Prices around the World</a></li>
<li><a href="https://github.com/aatishb/maskmath">aatishb/maskmath: An Explorable Essay on How Masks Can End COVID-19</a></li>
<li>Need to download all the images from this tweet by <a href="https://twitter.com/waitbutwhy/status/1407390418980032528">Tim Urban about graphs/diagrams</a></li>
<li><a href="https://www.yelpeconomicaverage.com/yelp-coronavirus-economic-impact-report.html">Yelp: Local Economic Impact Report</a></li>
<li><a href="https://www.welcomelawfirm.com/blog/where-americans-are-born/">Where Are Americans Born? An Analysis of U.S. Census Data from 1850 - 2020</a></li>
<li><a href="https://news.gallup.com/poll/284009/library-visits-outpaced-trips-movies-2019.aspx">In U.S., Library Visits Outpaced Trips to Movies in 2019</a></li>
<li><a href="https://github.com/platers/MAL-Map">GitHub - platers/MAL-Map: Cluster and visualize relationships between anime o&#x2026;</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgba0e399" class="outline-3">
<h3 id="orgba0e399"><span class="section-number-3">10.3.</span> Datasets</h3>
<div class="outline-text-3" id="text-10-3">
<ul class="org-ul">
<li><a href="https://www.benthamsgaze.org/2023/03/01/what-is-synthetic-data-the-good-the-bad-and-the-ugly/">What is Synthetic Data? The Good, the Bad, and the Ugly – Bentham’s Gaze</a></li>
<li><a href="https://news.ycombinator.com/item?id=34935712">Open Airport Map | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=34630409">Show HN: Groundhog-day.com</a>  (See simon&rsquo;s comment)</li>
<li><a href="https://sportsdatabase.com/">https://sportsdatabase.com/</a></li>
<li>Domains
<ul class="org-ul">
<li><a href="https://s3-us-west-1.amazonaws.com/umbrella-static/index.html">Cisco Popularity List</a></li>
<li><a href="https://tranco-list.eu/">A research-oriented top sites ranking hardened against manipulation - Tranco</a></li>
<li><a href="https://majestic.com/reports/majestic-million">Majestic Million</a></li>
<li><a href="https://cdn.smoot.apple.com/static/autofill_tld_whitelist_url">https://cdn.smoot.apple.com/static/autofill_tld_whitelist_url</a></li>
</ul></li>
<li><a href="https://news.ycombinator.com/item?id=34558054">The magic of small databases | Hacker News</a></li>
<li><a href="https://cpaproject.in/">Criminal Justice And Police Accountability Project</a></li>
<li><a href="https://dataverse.org/">The Dataverse Project - Dataverse.org</a></li>
<li><a href="https://webdataset.github.io/webdataset/">webdataset</a></li>
<li><a href="https://otd.delhi.gov.in/">Open Transit Data | Delhi</a></li>
<li><a href="https://app.airframes.io/">Airframes</a></li>
<li><a href="https://docs.irail.be/">iRail API Docs</a></li>
<li><a href="https://www.landconflictwatch.org/">Land Conflict Watch</a></li>
<li><a href="https://www.dolthub.com/blog/2022-12-02-open-source-hospital-price-transparency/">Open Source Hospital Price Transparency | DoltHub Blog</a></li>
<li><a href="https://news.ycombinator.com/item?id=26956271">OpenFlights – airport and airline data | Hacker News</a></li>
<li><a href="https://crhallberg.com/cah/">JSON Against Humanity</a></li>
<li><a href="https://news.ycombinator.com/item?id=33346091">Ship Wreck Database | Hacker News</a></li>
<li><a href="https://lobste.rs/s/5guoty/recommendations_thread_your_favorite">Recommendations thread: Your favorite sources of raw data (of any type)</a></li>
<li><a href="https://www.gisgraphy.com/index.php">Open source geocoder and addresses database / POIs database in CSV</a></li>
<li><a href="https://www.reddit.com/r/datasets/">https://www.reddit.com/r/datasets/</a></li>
<li><a href="https://data.worldbank.org/">World Bank Open Data | Data</a></li>
<li><a href="https://www.gharchive.org/">GH Archive</a></li>
<li><a href="https://github.com/awesomedata/awesome-public-datasets">awesomedata/awesome-public-datasets: A topic-centric list</a></li>
<li><a href="https://github.com/tidwall/cities">GitHub - tidwall/cities: 10,000 Cities with Latitude, Longitude, and Elevatio&#x2026;</a></li>
<li><a href="https://github.com/trustwallet/assets">trustwallet/assets</a>: A comprehensive, up-to-date collection of information about several thousands (!) of crypto tokens.</li>
<li><a href="https://github.com/factbook/factbook.json">factbook/factbook.json</a>: World Factbook Country Profiles in JSON</li>
<li><a href="https://data.gov.in/">Open Government Data (OGD) Platform India</a></li>
<li><a href="https://ourworldindata.org/internet">Internet - Our World in Data</a></li>
<li><a href="https://github.com/iamcal/emoji-data">GitHub - iamcal/emoji-data: Easy to parse data and spritesheets for emoji</a></li>
<li><a href="https://github.com/dracos/Theatricalia">dracos/Theatricalia: A database of past and future theatre productions</a></li>
<li><a href="https://gitlab.com/CashlessConsumer/data-analysis-notebooks/-/wikis/Payments-System-Data-Dashboard">Payments System Data Dashboard · Wiki · CashlessConsumer / Data Analysis Note&#x2026;</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbe67164" class="outline-3">
<h3 id="orgbe67164"><span class="section-number-3">10.4.</span> Inspirations</h3>
<div class="outline-text-3" id="text-10-4">
<ul class="org-ul">
<li><a href="https://ai-observatory.in/">ai-observatory</a></li>
<li><a href="https://setosa.io/#/">Setosa data visualization and visual explanations</a></li>
<li><a href="https://www.populationpyramid.net/">Population of WORLD 2019 - PopulationPyramid.net</a></li>
<li><a href="https://informationisbeautiful.net/">Information is Beautiful</a></li>
<li><a href="https://twitter.com/landconflicts">https://twitter.com/landconflicts</a></li>
<li><a href="https://storywrangling.org/">StoryWrangler - Twitter Ngram Search</a></li>
<li><a href="https://www.reddit.com/r/IndiaSpeaks/comments/nma9oi/network_diagram_of_north_indian_extended_families/">Network diagram of North Indian extended families. Credit: India in Pixels : &#x2026;</a></li>
</ul>
</div>
</div>
