assets/pages/syllabus.org
** Tools
- [[https://python-charts.com/][PYTHON CHARTS | The definitive Python data visualization site]]
- [[https://iamkate.com/data/12-bit-rainbow/][The 12-bit rainbow palette]]
- [[https://inteltechniques.com/tools/][IntelTechniques OSINT Online Search Tool]]
- [[https://news.ycombinator.com/item?id=33272373][Traff: A universal format for live traffic information | Hacker News]]
- [[https://github.com/microsoft/SandDance][microsoft/SandDance: Visually explore, understand, and present your ...]]
- [[https://textvis.lnu.se/][Text Visualization Browser]]
- [[https://github.com/indiainpixels/barchart-racing][indiainpixels/barchart-racing: The code base that powered IIP]]
- [[https://simonwillison.net/2022/Jul/11/sqlite-comprehend/][sqlite-comprehend: run AWS entity extraction against content]]
- [[https://github.com/plouc/nivo][plouc/nivo: nivo provides a rich set of dataviz components]]
- [[https://github.com/biolab/orange3][GitHub - biolab/orange3: 🍊 Orange: Interactive data analysis]]
- [[https://github.com/vega/vega][vega/vega: A visualization grammar.]]
- [[https://www.datawrapper.de/][Datawrapper: Create charts, maps, and tables]]
- [[https://github.com/vega/voyager][vega/voyager: Visualization Tool for Data Exploration]]
- [[https://github.com/apache/superset][apache/superset: Apache Superset is a Data Visualization]]
- [[https://github.com/microsoft/SandDance][microsoft/SandDance: Visually explore, understand]]
- [[http://flowingmedia.com/gallery.html][Flowing Media: Your Data Has Something To Say]]
- [[https://github.com/facebookresearch/Kats][facebookresearch/Kats: Kats, a kit to analyze time series data]]
- [[https://github.com/mathisonian/awesome-visualization-research][mathisonian/awesome-visualization-research]]
- Wikipedia related
  - [[https://techblog.wikimedia.org/2021/06/07/searching-for-wikipedia/][Searching for Wikipedia]]
  - [[https://github.com/WDscholia/scholia][WDscholia/scholia: Wikidata-based scholarly profiles]]
** Random links
- [[https://github.com/taivop/awesome-data-annotation][taivop/awesome-data-annotation: A list of tools for annotating data]]
- [[https://www.openculture.com/2022/09/how-writing-has-spread-across-the-world-from-3000-bc-to-this-year-an-animated-map.html][How Writing Has Spread Across the World, from 3000 BC to This Year]]
- [[https://www.ucl.ac.uk/lbs/][Legacies of British Slavery]]
- [[https://www.datocapital.uk/][United Kingdom company and directors search.]]
- [[https://landregistry.data.gov.uk/app/ukhpi][UK House Price Index]]
** Books
- [[https://inteltechniques.com/book1.html][Open Source Intelligence Techniques]]
* Machine Learning
** Reading lists
- [[https://www.youtube.com/watch?v=48gBPL7aHJY&list=PL86uXYUJ7999zE8u2-97i4KG_2Zpufkfb&index=3][The Neuroscience of “Attention” - YouTube]]
- [[https://news.ycombinator.com/item?id=35110910][Ask HN: Best resources to learn more about GPT, Chinchilla, LLaMa? | Hacker News]]
** Blogposts
- [[https://e2eml.school/transformers.html?s=35][Transformers from Scratch]]
- [[https://news.ycombinator.com/item?id=35288063][Hello Dolly: Democratizing the magic of ChatGPT with open models | Hacker News]]
- [[https://huggingface.co/docs/transformers/quicktour][Quick tour]] (Transformers)
- [[https://rez0.blog/hacking/2023/02/21/hacking-with-chatgpt.html][Hacking with ChatGPT: Ideal Tasks and Use-Cases · rez0]]
- [[https://marcotm.com/articles/information-extraction-with-large-language-models-parsing-unstructured-data-with-gpt/][Information Extraction with Large Language Models]]
- [[https://news.ycombinator.com/item?id=35299071][Ask HN: How are you using GPT to be productive? | Hacker News]]
- [[https://news.ycombinator.com/item?id=35273406][Cheating is All You Need | Hacker News]]
- [[https://news.ycombinator.com/item?id=35266151][Ask HN: Whats the best TTS engine you&#x27;ve heard? | Hacker News]]
** Tools
[[https://news.ycombinator.com/item?id=35349608][- Gpt4all: A chatbot trained on ~800k GPT-3.5-Turbo Generations based on LLaMa | Hacker News]]
[[https://news.ycombinator.com/item?id=35343791][- LLMs and GPT: Some of my favorite learning materials | Hacker News]]
- https://github.com/mlc-ai/web-stable-diffusion
- [[https://news.ycombinator.com/item?id=35304078][Show HN: Aquarium – AI Controlled Containers | Hacker News]]
- [[https://news.ycombinator.com/item?id=35297766][Autodoc: Toolkit for auto-generating codebase documentation using LLMs]]
- [[https://news.ycombinator.com/item?id=35287740][Alpaca-LoRA with Docker | Hacker News]]
- https://github.com/antimatter15/alpaca.cpp
- https://github.com/tloen/alpaca-lora
- [[https://news.ycombinator.com/item?id=35239972][Run 100B+ language models at home, BitTorrentstyle | Hacker News]]
- [[https://news.ycombinator.com/item?id=35254389][A ChatGPT Emacs Shell | Hacker News]]
- [[https://news.ycombinator.com/item?id=35180429][TextSynth Server | Hacker News]]
- https://github.com/ggerganov/whisper.cpp
- [[https://news.ycombinator.com/item?id=35100086][Llama.cpp: Port of Facebook]]
- [[https://www.futuretools.io/][Future Tools - Find The Exact AI Tool For Your Needs]]
* [#C] Map and Geography
