static/syllabus.html
<div id="outline-container-org49e8130" class="outline-3">
<h3 id="org49e8130"><span class="section-number-3">10.5.</span> Tools</h3>
<div class="outline-text-3" id="text-10-5">
<ul class="org-ul">
<li><a href="https://python-charts.com/">PYTHON CHARTS | The definitive Python data visualization site</a></li>
<li><a href="https://iamkate.com/data/12-bit-rainbow/">The 12-bit rainbow palette</a></li>
<li><a href="https://inteltechniques.com/tools/">IntelTechniques OSINT Online Search Tool</a></li>
<li><a href="https://news.ycombinator.com/item?id=33272373">Traff: A universal format for live traffic information | Hacker News</a></li>
<li><a href="https://github.com/microsoft/SandDance">microsoft/SandDance: Visually explore, understand, and present your &#x2026;</a></li>
<li><a href="https://textvis.lnu.se/">Text Visualization Browser</a></li>
<li><a href="https://github.com/indiainpixels/barchart-racing">indiainpixels/barchart-racing: The code base that powered IIP</a></li>
<li><a href="https://simonwillison.net/2022/Jul/11/sqlite-comprehend/">sqlite-comprehend: run AWS entity extraction against content</a></li>
<li><a href="https://github.com/plouc/nivo">plouc/nivo: nivo provides a rich set of dataviz components</a></li>
<li><a href="https://github.com/biolab/orange3">GitHub - biolab/orange3: 🍊 Orange: Interactive data analysis</a></li>
<li><a href="https://github.com/vega/vega">vega/vega: A visualization grammar.</a></li>
<li><a href="https://www.datawrapper.de/">Datawrapper: Create charts, maps, and tables</a></li>
<li><a href="https://github.com/vega/voyager">vega/voyager: Visualization Tool for Data Exploration</a></li>
<li><a href="https://github.com/apache/superset">apache/superset: Apache Superset is a Data Visualization</a></li>
<li><a href="https://github.com/microsoft/SandDance">microsoft/SandDance: Visually explore, understand</a></li>
<li><a href="http://flowingmedia.com/gallery.html">Flowing Media: Your Data Has Something To Say</a></li>
<li><a href="https://github.com/facebookresearch/Kats">facebookresearch/Kats: Kats, a kit to analyze time series data</a></li>
<li><a href="https://github.com/mathisonian/awesome-visualization-research">mathisonian/awesome-visualization-research</a></li>
<li>Wikipedia related
<ul class="org-ul">
<li><a href="https://techblog.wikimedia.org/2021/06/07/searching-for-wikipedia/">Searching for Wikipedia</a></li>
<li><a href="https://github.com/WDscholia/scholia">WDscholia/scholia: Wikidata-based scholarly profiles</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org60f64be" class="outline-3">
<h3 id="org60f64be"><span class="section-number-3">10.6.</span> Random links</h3>
<div class="outline-text-3" id="text-10-6">
<ul class="org-ul">
<li><a href="https://github.com/taivop/awesome-data-annotation">taivop/awesome-data-annotation: A list of tools for annotating data</a></li>
<li><a href="https://www.openculture.com/2022/09/how-writing-has-spread-across-the-world-from-3000-bc-to-this-year-an-animated-map.html">How Writing Has Spread Across the World, from 3000 BC to This Year</a></li>
<li><a href="https://www.ucl.ac.uk/lbs/">Legacies of British Slavery</a></li>
<li><a href="https://www.datocapital.uk/">United Kingdom company and directors search.</a></li>
<li><a href="https://landregistry.data.gov.uk/app/ukhpi">UK House Price Index</a></li>
</ul>
</div>
</div>
<div id="outline-container-org2b24726" class="outline-3">
<h3 id="org2b24726"><span class="section-number-3">10.7.</span> Books</h3>
<div class="outline-text-3" id="text-10-7">
<ul class="org-ul">
<li><a href="https://inteltechniques.com/book1.html">Open Source Intelligence Techniques</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0baf777" class="outline-2">
<h2 id="org0baf777"><span class="section-number-2">11.</span> Machine Learning</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgd08688f" class="outline-3">
<h3 id="orgd08688f"><span class="section-number-3">11.1.</span> Reading lists</h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=48gBPL7aHJY&amp;list=PL86uXYUJ7999zE8u2-97i4KG_2Zpufkfb&amp;index=3">The Neuroscience of “Attention” - YouTube</a></li>
<li><a href="https://news.ycombinator.com/item?id=35110910">Ask HN: Best resources to learn more about GPT, Chinchilla, LLaMa? | Hacker News</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7e5f184" class="outline-3">
<h3 id="org7e5f184"><span class="section-number-3">11.2.</span> Blogposts</h3>
<div class="outline-text-3" id="text-11-2">
<ul class="org-ul">
<li><a href="https://e2eml.school/transformers.html?s=35">Transformers from Scratch</a></li>
<li><a href="https://news.ycombinator.com/item?id=35288063">Hello Dolly: Democratizing the magic of ChatGPT with open models | Hacker News</a></li>
<li><a href="https://huggingface.co/docs/transformers/quicktour">Quick tour</a> (Transformers)</li>
<li><a href="https://rez0.blog/hacking/2023/02/21/hacking-with-chatgpt.html">Hacking with ChatGPT: Ideal Tasks and Use-Cases · rez0</a></li>
<li><a href="https://marcotm.com/articles/information-extraction-with-large-language-models-parsing-unstructured-data-with-gpt/">Information Extraction with Large Language Models</a></li>
<li><a href="https://news.ycombinator.com/item?id=35299071">Ask HN: How are you using GPT to be productive? | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=35273406">Cheating is All You Need | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=35266151">Ask HN: Whats the best TTS engine you&amp;#x27;ve heard? | Hacker News</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge773e54" class="outline-3">
<h3 id="orge773e54"><span class="section-number-3">11.3.</span> Tools</h3>
<div class="outline-text-3" id="text-11-3">
<ul class="org-ul">
<li><a href="https://github.com/mlc-ai/web-stable-diffusion">https://github.com/mlc-ai/web-stable-diffusion</a></li>
<li><a href="https://news.ycombinator.com/item?id=35304078">Show HN: Aquarium – AI Controlled Containers | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=35297766">Autodoc: Toolkit for auto-generating codebase documentation using LLMs</a></li>
<li><a href="https://news.ycombinator.com/item?id=35287740">Alpaca-LoRA with Docker | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=35239972">Run 100B+ language models at home, BitTorrentstyle | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=35254389">A ChatGPT Emacs Shell | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=35180429">TextSynth Server | Hacker News</a></li>
<li><a href="https://github.com/ggerganov/whisper.cpp">https://github.com/ggerganov/whisper.cpp</a></li>
<li><a href="https://news.ycombinator.com/item?id=35100086">Llama.cpp: Port of Facebook</a></li>
<li><a href="https://www.futuretools.io/">Future Tools - Find The Exact AI Tool For Your Needs</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9a0b47c" class="outline-2">
<h2 id="org9a0b47c"><span class="section-number-2">12.</span> Map and Geography</h2>
<div class="outline-text-2" id="text-12">
</div>
