assets/pages/syllabus.org
** Blog-posts
- [[https://news.ycombinator.com/item?id=35312238][Evaluation of Location Encoding Systems (2021) | Hacker News]]
- [[http://blog.zarfhome.com/2023/02/a-treasury-of-zork-maps.html?m=1][Zarf Updates: A treasury of Zork maps]]
- [[https://news.ycombinator.com/item?id=34836700][Replacing Mapbox with open source solutions | Hacker News]]
- [[https://news.ycombinator.com/item?id=34684741][Explore the Silk Roads | Hacker News]]
- [[https://news.ycombinator.com/item?id=34742923][QGIS is the mapping software you didn&#x27;t know you needed | Hacker News]]
- [[https://news.ycombinator.com/item?id=34680958][OpenStreetMap is in trouble – a critical take on Bing Map Builder | Hacker News]]
- [[https://news.ycombinator.com/item?id=34686552][Ask HN: Getting Started with (Q)GIS? | Hacker News]]
- [[https://news.ycombinator.com/item?id=34469378][Paper map sales are booming | Hacker News]]
- [[https://ciechanow.ski/gps/][GPS – Bartosz Ciechanowski]]
- [[https://sidagarwal.notion.site/Experiments-with-maps-1a082b90926a4c41b8a25bc8e9d9b9fa][Experiments with maps]]
- [[https://tafc.space/qna/the-topologists-world-map/][The topologist’s world map – tafc.space]]
- [[https://www.wsj.com/articles/why-paper-map-sales-are-booming-11674164824][Forget Google Maps: Why Paper Map Sales Are Booming - WSJ]]
- [[https://waterdata.usgs.gov/blog/snow-tiles-demo/][Origin and development of a Snowflake Map | Water Data For The Nation Blog]]
- [[https://storymaps.arcgis.com/stories/1e7f582d478a4b99bd0c70fffeac4c8b][Misconceptions]]
- [[https://daily.jstor.org/pictorial-maps-of-the-united-states/][Pictorial Maps of the United States - JSTOR Daily]]
- [[https://www.antonthomasart.com/][Home - Anton Thomas Art]]
- [[https://mappinglondon.co.uk/2013/hexagonal-map-of-london/][Hexagonal Map of London – Mapping London]]
- [[https://en.wikipedia.org/wiki/Land_use_statistics_by_country][Land use statistics by country - Wikipedia]]
- [[https://docs.geotools.org/latest/userguide/library/referencing/order.html][Axis Order — GeoTools 29-SNAPSHOT User Guide]]
- [[https://zeihan.com/end-of-the-world-maps/][The End of the World is Just The Beginning Maps - Zeihan on Geopolitics]]
** Others
- [[https://github.com/Malvoz/web-maps-wcag-evaluation][GitHub - Malvoz/web-maps-wcag-evaluation]]
- [[https://www.reddit.com/r/dataisbeautiful/comments/1017pz2/oc_equalearth_vs_webmercator/][{OC} EqualEarth vs WebMercator : dataisbeautiful]]
** Tools
- [[https://news.ycombinator.com/item?id=35089776][Serverless maps at 1&#x2F;700 the cost of Google Maps API | Hacker News]]
- [[https://news.ycombinator.com/item?id=34919659][Eduard: Swiss-Style Relief Shading for Maps Using Machine Learning | Hacker News]]
- [[https://news.ycombinator.com/item?id=34530217][Self-hosted vector tiles | Hacker News]]
- [[https://news.ycombinator.com/item?id=33491697][3D map of the Czech Republic, made from 12.5cm&#x2F;px imagery (2017)]]
- [[https://cubetrek.com/][CubeTrek]]
* [#B] Compilers, Interpreters and PLT
** Meta
- [ ] [[https://c9x.me/compile/bib/][The Compiler Writer Resource Page]]
** Lectures
- [[https://www.cs.cornell.edu/courses/cs6120/2020fa/self-guided/][CS 6120]] 
** Books
- [[https://htdp.org/][How to Design Programs]]
- [[https://rust-hosted-langs.github.io/book/introduction.html][Introduction - Writing Interpreters in Rust: a Guide]]
** Blog-posts
- Parsing
  - [[https://dev-nonsense.com/posts/incremental-parsing-in-go/][incremental parsing in go | dev-nonsense]]
  - [[https://tomassetti.me/parsing-sql/][Parsing SQL - Strumenta]]
  - [[https://tomassetti.me/guide-parsing-algorithms-terminology/][A Guide To Parsing: Algorithms And Terminology]]
  - [[https://tratt.net/laurie/essays/entries/which_parsing_approach.html][Laurence Tratt: Which Parsing Approach?]]
  - [[https://neilmadden.blog/2020/11/25/parse-dont-type-check/][Parse, don’t type-check – Neil Madden]]
- Compilers
  - [[https://prog21.dadgum.com/30.html][Want to Write a Compiler? Just Read These Two Papers.]]
  - [[https://hacks.mozilla.org/2017/02/a-crash-course-in-just-in-time-jit-compilers/][A crash course in just-in-time (JIT) compilers - Mozilla Hacks]]
- LLVM
  - [[https://lowlevelbits.org/how-to-learn-compilers-llvm-edition/][How to learn compilers: LLVM Edition - Low Level Bits]]
  - [[https://www.cs.cornell.edu/~asampson/blog/llvm.html][Adrian Sampson: LLVM for Grad Students]]
- PLT
  - [[http://blog.felipe.rs/2017/07/07/where-do-type-systems-come-from/][Where do Type Systems Come From?]]
  - [[https://artagnon.com/articles/tech/pl][An opinionated history of programming languages | artagnon.com]]
- Regex
  - [[https://dassur.ma/things/regexp-quote/][My most useful RegExp trick — surma.dev]]
** Tools
- [[https://github.com/analysis-tools-dev/static-analysis][analysis-tools-dev/static-analysis]]: A curated list of static analysis (SAST) tools for all programming languages, config files, build tools, and more. The focus is on tools which improve code quality.
* [#B] Security
** Lectures
** Book
- [[https://guyinatuxedo.github.io/][Nightmare - Nightmare]]
** Tools
- [[https://github.com/zardus/ctf-tools][GitHub - zardus/ctf-tools: Some setup scripts for security research tools.]]
- [[https://github.com/rshipp/awesome-malware-analysis][GitHub - rshipp/awesome-malware-analysis: Defund the Police.]]
- [[https://github.com/eugenekolo/sec-tools][GitHub - eugenekolo/sec-tools: A set of security related tools]]
- [[https://github.com/brannondorsey/wifi-cracking][GitHub - brannondorsey/wifi-cracking: Crack WPA/WPA2 Wi-Fi Routers with Airodump-ng and Aircrack-ng/Hashcat]]
- [[https://github.com/stuhli/awesome-event-ids][GitHub - stuhli/awesome-event-ids: Collection of Event ID ressources useful for Digital Forensics and Incident Response]]
- [[https://github.com/fiatjaf/awesome-loginless][GitHub - fiatjaf/awesome-loginless: an awesome list of internet services that don't require logins or registrations]]
- [[https://github.com/herrjemand/awesome-webauthn][GitHub - herrjemand/awesome-webauthn: A curated list of awesome WebAuthn/FIDO2 and now Passkey resources]]
