static/syllabus.html
<div id="outline-container-org2df0f61" class="outline-3">
<h3 id="org2df0f61"><span class="section-number-3">12.1.</span> Blog-posts</h3>
<div class="outline-text-3" id="text-12-1">
<ul class="org-ul">
<li><a href="https://news.ycombinator.com/item?id=35312238">Evaluation of Location Encoding Systems (2021) | Hacker News</a></li>
<li><a href="http://blog.zarfhome.com/2023/02/a-treasury-of-zork-maps.html?m=1">Zarf Updates: A treasury of Zork maps</a></li>
<li><a href="https://news.ycombinator.com/item?id=34836700">Replacing Mapbox with open source solutions | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=34684741">Explore the Silk Roads | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=34742923">QGIS is the mapping software you didn&amp;#x27;t know you needed | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=34680958">OpenStreetMap is in trouble – a critical take on Bing Map Builder | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=34686552">Ask HN: Getting Started with (Q)GIS? | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=34469378">Paper map sales are booming | Hacker News</a></li>
<li><a href="https://ciechanow.ski/gps/">GPS – Bartosz Ciechanowski</a></li>
<li><a href="https://sidagarwal.notion.site/Experiments-with-maps-1a082b90926a4c41b8a25bc8e9d9b9fa">Experiments with maps</a></li>
<li><a href="https://tafc.space/qna/the-topologists-world-map/">The topologist’s world map – tafc.space</a></li>
<li><a href="https://www.wsj.com/articles/why-paper-map-sales-are-booming-11674164824">Forget Google Maps: Why Paper Map Sales Are Booming - WSJ</a></li>
<li><a href="https://waterdata.usgs.gov/blog/snow-tiles-demo/">Origin and development of a Snowflake Map | Water Data For The Nation Blog</a></li>
<li><a href="https://storymaps.arcgis.com/stories/1e7f582d478a4b99bd0c70fffeac4c8b">Misconceptions</a></li>
<li><a href="https://daily.jstor.org/pictorial-maps-of-the-united-states/">Pictorial Maps of the United States - JSTOR Daily</a></li>
<li><a href="https://www.antonthomasart.com/">Home - Anton Thomas Art</a></li>
<li><a href="https://mappinglondon.co.uk/2013/hexagonal-map-of-london/">Hexagonal Map of London – Mapping London</a></li>
<li><a href="https://en.wikipedia.org/wiki/Land_use_statistics_by_country">Land use statistics by country - Wikipedia</a></li>
<li><a href="https://docs.geotools.org/latest/userguide/library/referencing/order.html">Axis Order — GeoTools 29-SNAPSHOT User Guide</a></li>
<li><a href="https://zeihan.com/end-of-the-world-maps/">The End of the World is Just The Beginning Maps - Zeihan on Geopolitics</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd3c9fdd" class="outline-3">
<h3 id="orgd3c9fdd"><span class="section-number-3">12.2.</span> Others</h3>
<div class="outline-text-3" id="text-12-2">
<ul class="org-ul">
<li><a href="https://github.com/Malvoz/web-maps-wcag-evaluation">GitHub - Malvoz/web-maps-wcag-evaluation</a></li>
<li><a href="https://www.reddit.com/r/dataisbeautiful/comments/1017pz2/oc_equalearth_vs_webmercator/">{OC} EqualEarth vs WebMercator : dataisbeautiful</a></li>
</ul>
</div>
</div>
<div id="outline-container-org043378c" class="outline-3">
<h3 id="org043378c"><span class="section-number-3">12.3.</span> Tools</h3>
<div class="outline-text-3" id="text-12-3">
<ul class="org-ul">
<li><a href="https://news.ycombinator.com/item?id=35089776">Serverless maps at 1&amp;#x2F;700 the cost of Google Maps API | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=34919659">Eduard: Swiss-Style Relief Shading for Maps Using Machine Learning | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=34530217">Self-hosted vector tiles | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=33491697">3D map of the Czech Republic, made from 12.5cm&amp;#x2F;px imagery (2017)</a></li>
<li><a href="https://cubetrek.com/">CubeTrek</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgccdab99" class="outline-2">
<h2 id="orgccdab99"><span class="section-number-2">13.</span> Compilers, Interpreters and PLT</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org5e3071c" class="outline-3">
<h3 id="org5e3071c"><span class="section-number-3">13.1.</span> Meta</h3>
<div class="outline-text-3" id="text-13-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <a href="https://c9x.me/compile/bib/">The Compiler Writer Resource Page</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgdd1c866" class="outline-3">
<h3 id="orgdd1c866"><span class="section-number-3">13.2.</span> Lectures</h3>
<div class="outline-text-3" id="text-13-2">
<ul class="org-ul">
<li><a href="https://www.cs.cornell.edu/courses/cs6120/2020fa/self-guided/">CS 6120</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9452672" class="outline-3">
<h3 id="org9452672"><span class="section-number-3">13.3.</span> Books</h3>
<div class="outline-text-3" id="text-13-3">
<ul class="org-ul">
<li><a href="https://htdp.org/">How to Design Programs</a></li>
<li><a href="https://rust-hosted-langs.github.io/book/introduction.html">Introduction - Writing Interpreters in Rust: a Guide</a></li>
</ul>
</div>
</div>
<div id="outline-container-org74a37ad" class="outline-3">
<h3 id="org74a37ad"><span class="section-number-3">13.4.</span> Blog-posts</h3>
<div class="outline-text-3" id="text-13-4">
<ul class="org-ul">
<li>Parsing
<ul class="org-ul">
<li><a href="https://dev-nonsense.com/posts/incremental-parsing-in-go/">incremental parsing in go | dev-nonsense</a></li>
<li><a href="https://tomassetti.me/parsing-sql/">Parsing SQL - Strumenta</a></li>
<li><a href="https://tomassetti.me/guide-parsing-algorithms-terminology/">A Guide To Parsing: Algorithms And Terminology</a></li>
<li><a href="https://tratt.net/laurie/essays/entries/which_parsing_approach.html">Laurence Tratt: Which Parsing Approach?</a></li>
<li><a href="https://neilmadden.blog/2020/11/25/parse-dont-type-check/">Parse, don’t type-check – Neil Madden</a></li>
</ul></li>
<li>Compilers
<ul class="org-ul">
<li><a href="https://prog21.dadgum.com/30.html">Want to Write a Compiler? Just Read These Two Papers.</a></li>
<li><a href="https://hacks.mozilla.org/2017/02/a-crash-course-in-just-in-time-jit-compilers/">A crash course in just-in-time (JIT) compilers - Mozilla Hacks</a></li>
</ul></li>
<li>LLVM
<ul class="org-ul">
<li><a href="https://lowlevelbits.org/how-to-learn-compilers-llvm-edition/">How to learn compilers: LLVM Edition - Low Level Bits</a></li>
<li><a href="https://www.cs.cornell.edu/~asampson/blog/llvm.html">Adrian Sampson: LLVM for Grad Students</a></li>
</ul></li>
<li>PLT
<ul class="org-ul">
<li><a href="http://blog.felipe.rs/2017/07/07/where-do-type-systems-come-from/">Where do Type Systems Come From?</a></li>
<li><a href="https://artagnon.com/articles/tech/pl">An opinionated history of programming languages | artagnon.com</a></li>
</ul></li>
<li>Regex
<ul class="org-ul">
<li><a href="https://dassur.ma/things/regexp-quote/">My most useful RegExp trick — surma.dev</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgde2f190" class="outline-3">
<h3 id="orgde2f190"><span class="section-number-3">13.5.</span> Tools</h3>
<div class="outline-text-3" id="text-13-5">
<ul class="org-ul">
<li><a href="https://github.com/analysis-tools-dev/static-analysis">analysis-tools-dev/static-analysis</a>: A curated list of static analysis (SAST) tools for all programming languages, config files, build tools, and more. The focus is on tools which improve code quality.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd8f26c4" class="outline-2">
<h2 id="orgd8f26c4"><span class="section-number-2">14.</span> Security</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-orgf25b600" class="outline-3">
<h3 id="orgf25b600"><span class="section-number-3">14.1.</span> Lectures</h3>
</div>
<div id="outline-container-org6a3fa90" class="outline-3">
<h3 id="org6a3fa90"><span class="section-number-3">14.2.</span> Book</h3>
<div class="outline-text-3" id="text-14-2">
<ul class="org-ul">
<li><a href="https://guyinatuxedo.github.io/">Nightmare - Nightmare</a></li>
</ul>
</div>
</div>
<div id="outline-container-org026d83d" class="outline-3">
<h3 id="org026d83d"><span class="section-number-3">14.3.</span> Tools</h3>
<div class="outline-text-3" id="text-14-3">
<ul class="org-ul">
<li><a href="https://github.com/zardus/ctf-tools">GitHub - zardus/ctf-tools: Some setup scripts for security research tools.</a></li>
<li><a href="https://github.com/rshipp/awesome-malware-analysis">GitHub - rshipp/awesome-malware-analysis: Defund the Police.</a></li>
<li><a href="https://github.com/eugenekolo/sec-tools">GitHub - eugenekolo/sec-tools: A set of security related tools</a></li>
<li><a href="https://github.com/brannondorsey/wifi-cracking">GitHub - brannondorsey/wifi-cracking: Crack WPA/WPA2 Wi-Fi Routers with Airodump-ng and Aircrack-ng/Hashcat</a></li>
<li><a href="https://github.com/stuhli/awesome-event-ids">GitHub - stuhli/awesome-event-ids: Collection of Event ID ressources useful for Digital Forensics and Incident Response</a></li>
<li><a href="https://github.com/fiatjaf/awesome-loginless">GitHub - fiatjaf/awesome-loginless: an awesome list of internet services that don&rsquo;t require logins or registrations</a></li>
<li><a href="https://github.com/herrjemand/awesome-webauthn">GitHub - herrjemand/awesome-webauthn: A curated list of awesome WebAuthn/FIDO2 and now Passkey resources</a></li>
</ul>
</div>
</div>
