assets/pages/syllabus.org
** Blog-posts
- ZK
  - [[https://avestura.dev/blog/zero-knowledge-proofs][Understanding zero-knowledge proofs]]
  - [[https://news.ycombinator.com/item?id=33277371][What the Deal with Zkapps? | Hacker News]]
  - [[https://www.youtube.com/watch?v=fOGdb1CTu5c][Computer Scientist Explains One Concept in 5 Levels of Difficulty | WIRED - Y...]]
  - [[https://www.crowdcast.io/e/zero-knowledge-architecture/register][Building a Zero Knowledge Architecture - Crowdcast]]
  - https://people.cs.georgetown.edu/jthaler/ProofsArgsAndZK.pdf
  - [[https://learn.0xparc.org/][ZK Learning Resources]]
  - [[https://zkhack.dev/][ZK Hack]]
  - https://arxiv.org/abs/1906.07221
- Cryptography
  - [[https://fangpenlin.com/posts/2019/10/07/elliptic-curve-cryptography-explained/][Elliptic Curve Cryptography Explained – Fang-Pen's coding note]]
  - [[https://soatok.blog/2023/04/03/asymmetric-cryptographic-commitments/][Asymmetric Cryptographic Commitments - Dhole Moments]]
  - [[https://soatok.blog/2021/01/20/please-stop-encrypting-with-rsa-directly/][Please Stop Encrypting with RSA Directly - Dhole Moments]]
  - [[https://www.thesslstore.com/blog/bleichenbachers-cat-rsa-key-exchange/][Bleichenbacher's CAT: Stop using RSA key exchange - Hashed Out]]
  - [[https://natmchugh.blogspot.com/2015/02/create-your-own-md5-collisions.html][Nat McHugh: Create your own MD5 collisions]]
  - [[https://soatok.blog/2020/09/12/edutech-spyware-is-still-spyware-proctorio-edition/][EduTech Spyware is Still Spyware: Proctorio Edition - Dhole Moments]]
- Others
  - [[https://sgtdede.gitbook.io/hacking/oscp-2022/guide-en][Guide (EN) - hacking]]
  - [[https://julienrenaux.fr/2019/12/20/github-actions-security-risk/][Use GitHub actions at your own risk]]
  - [[https://kestas.kuliukas.com/RainbowTables/][How Rainbow Tables work]]
  - [[https://cohost.org/ecn/post/498568-windows-and-root-ca][cohost! - "Windows and Root CA Certificates"]]
  - [[https://news.ycombinator.com/item?id=34131436][Ask HN: Has anyone successfully recovered photos from a broken Android phone?]]
* [#B] Network
** Meta
- [[https://github.com/leandromoreira/linux-network-performance-parameters][leandromoreira/linux-network-performance-parameters]]
** Books
- [[https://beej.us/guide/bgnet/][Beej's Guide to Network Programming]]
- [[https://www.privateinternetaccess.com/blog/linux-networking-stack-from-the-ground-up-part-1/][Linux networking stack from the ground up, part 1]]
- [[https://5g.systemsapproach.org/index.html][5G Mobile Networks: A Systems Approach — 5G Mobile Networks]]
- [[https://sdn.systemsapproach.org/index.html][Software-Defined Networks: A Systems Approach]]
** Blog-posts
- [[https://datatracker.ietf.org/doc/html/rfc1180][RFC 1180 - TCP/IP tutorial]]
- [[https://jameswillia.ms/posts/shortest-urls.html][Shortest URLs on the Internet | James Williams]]
- [[https://github.com/Raynos/topology][raynos/topology: Different network topologies]]
- [[https://developers.redhat.com/blog/2018/10/22/introduction-to-linux-interfaces-for-virtual-networking#][Introduction to Linux interfaces for virtual networking]]
- [[https://blog.apnic.net/2021/03/12/a-brief-history-of-router-architecture/][A brief history of router architecture | APNIC Blog]]
- [[https://engineering.atspotify.com/2016/01/sdn-internet-router-part-1/][SDN Internet Router – Part 1 : Spotify Engineering]]
* [#C] Finance and Economics
** Lectures
- [[https://pages.stern.nyu.edu/~adamodar/][A Damodaran Lectures]]
- [[https://www.khanacademy.org/economics-finance-domain/macroeconomics][Macroeconomics | Economics | Khan Academy]]
** Videos
- [[https://www.youtube.com/watch?v=PHe0bXAIuk0][How The Economic Machine Works by Ray Dalio - YouTube]]
** Blog-posts
- [[https://steveblank.com/2022/09/20/mapping-the-unknown-the-ten-steps-to-map-any-industry/][Steve Blank Mapping the Unknown – The Ten Steps to Map Any Industry]]
- [[https://www.audiosciencereview.com/forum/index.php?threads%2Fsecrets-about-the-consumer-audio-business-you-may-find-interesting.37344%2F]["Secrets" about the consumer audio business you may find interesting]]
- [[https://steveblank.com/raising-money/][Steve Blank Raising Money]]
- [[https://thelastbearstanding.substack.com/p/origins-of-inflation?s=35][Origins of Inflation - The Last Bear Standing]]
- [[https://news.ycombinator.com/item?id=30657245][How did the gold standard work? | Hacker News]]
- [[https://www.tradingview.com/chart/DJI/VHAXD1rx-DOW-JONES/][DOW JONES for TVC:DJI by EXCAVO — TradingView]]
- [[https://www.investopedia.com/articles/investing/012315/how-demographics-drive-economy.asp][How Demographics Drive the Economy]]
- [[https://steveblank.com/secret-history/][Steve Blank Secret History]]
** Others
- [[https://start.edgeryders.eu/page/15452][Edgeryders | Start]]
- [[https://blog.bolt.io/hardware-team-prototyping/?s=35][Hardware by the Numbers (Part 1: Team + Prototyping) – The Bolt Blog]]
- [[https://blog.bolt.io/ideation/?s=35][The Illustrated Guide to Product Development (Part 1: Ideation) – The Bolt Blog]]
* [#C] Computer Architecture
** Lectures
- [[https://computationstructures.org/index.html][computationstructures]]
- [[https://www.cs.cmu.edu/~213/schedule.html][15-213/15-513 Introduction to Computer Systems: Class Schedule]]
- [[https://www.coursera.org/learn/build-a-computer][Build a Modern Computer from First Principles: From Nand to Tetris]]
* [#C] Operating Systems and Kernel
** Reading list
- [[https://github.com/gurugio/lowlevelprogramming-university][gurugio/lowlevelprogramming-university: How to be low-level programmer]]
** Lectures
- [[https://www.cs.cmu.edu/~213/schedule.html][15-213/15-513 Introduction to Computer Systems: Class Schedule]] (CSAPP Book)
- [[https://github.com/angrave/SystemProgramming/wiki][angrave/SystemProgramming Wiki]]
- Virtualization
  - [[https://github.com/Wenzel/awesome-virtualization][Wenzel/awesome-virtualization]]
