static/syllabus.html
<div id="outline-container-org4b979b5" class="outline-3">
<h3 id="org4b979b5"><span class="section-number-3">14.4.</span> Blog-posts</h3>
<div class="outline-text-3" id="text-14-4">
<ul class="org-ul">
<li>ZK
<ul class="org-ul">
<li><a href="https://avestura.dev/blog/zero-knowledge-proofs">Understanding zero-knowledge proofs</a></li>
<li><a href="https://news.ycombinator.com/item?id=33277371">What the Deal with Zkapps? | Hacker News</a></li>
<li><a href="https://www.youtube.com/watch?v=fOGdb1CTu5c">Computer Scientist Explains One Concept in 5 Levels of Difficulty | WIRED - Y&#x2026;</a></li>
<li><a href="https://www.crowdcast.io/e/zero-knowledge-architecture/register">Building a Zero Knowledge Architecture - Crowdcast</a></li>
<li><a href="https://people.cs.georgetown.edu/jthaler/ProofsArgsAndZK.pdf">https://people.cs.georgetown.edu/jthaler/ProofsArgsAndZK.pdf</a></li>
<li><a href="https://learn.0xparc.org/">ZK Learning Resources</a></li>
<li><a href="https://zkhack.dev/">ZK Hack</a></li>
<li><a href="https://arxiv.org/abs/1906.07221">https://arxiv.org/abs/1906.07221</a></li>
</ul></li>
<li>Cryptography
<ul class="org-ul">
<li><a href="https://fangpenlin.com/posts/2019/10/07/elliptic-curve-cryptography-explained/">Elliptic Curve Cryptography Explained – Fang-Pen&rsquo;s coding note</a></li>
<li><a href="https://soatok.blog/2021/01/20/please-stop-encrypting-with-rsa-directly/">Please Stop Encrypting with RSA Directly - Dhole Moments</a></li>
<li><a href="https://www.thesslstore.com/blog/bleichenbachers-cat-rsa-key-exchange/">Bleichenbacher&rsquo;s CAT: Stop using RSA key exchange - Hashed Out</a></li>
<li><a href="https://natmchugh.blogspot.com/2015/02/create-your-own-md5-collisions.html">Nat McHugh: Create your own MD5 collisions</a></li>
<li><a href="https://soatok.blog/2020/09/12/edutech-spyware-is-still-spyware-proctorio-edition/">EduTech Spyware is Still Spyware: Proctorio Edition - Dhole Moments</a></li>
</ul></li>
<li>Others
<ul class="org-ul">
<li><a href="https://sgtdede.gitbook.io/hacking/oscp-2022/guide-en">Guide (EN) - hacking</a></li>
<li><a href="https://julienrenaux.fr/2019/12/20/github-actions-security-risk/">Use GitHub actions at your own risk</a></li>
<li><a href="https://kestas.kuliukas.com/RainbowTables/">How Rainbow Tables work</a></li>
<li><a href="https://cohost.org/ecn/post/498568-windows-and-root-ca">cohost! - &ldquo;Windows and Root CA Certificates&rdquo;</a></li>
<li><a href="https://news.ycombinator.com/item?id=34131436">Ask HN: Has anyone successfully recovered photos from a broken Android phone?</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6dd8ff6" class="outline-2">
<h2 id="org6dd8ff6"><span class="section-number-2">15.</span> Network</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org883fe66" class="outline-3">
<h3 id="org883fe66"><span class="section-number-3">15.1.</span> Meta</h3>
<div class="outline-text-3" id="text-15-1">
<ul class="org-ul">
<li><a href="https://github.com/leandromoreira/linux-network-performance-parameters">leandromoreira/linux-network-performance-parameters</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7e697b4" class="outline-3">
<h3 id="org7e697b4"><span class="section-number-3">15.2.</span> Books</h3>
<div class="outline-text-3" id="text-15-2">
<ul class="org-ul">
<li><a href="https://beej.us/guide/bgnet/">Beej&rsquo;s Guide to Network Programming</a></li>
<li><a href="https://www.privateinternetaccess.com/blog/linux-networking-stack-from-the-ground-up-part-1/">Linux networking stack from the ground up, part 1</a></li>
<li><a href="https://5g.systemsapproach.org/index.html">5G Mobile Networks: A Systems Approach — 5G Mobile Networks</a></li>
<li><a href="https://sdn.systemsapproach.org/index.html">Software-Defined Networks: A Systems Approach</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6725ad7" class="outline-3">
<h3 id="org6725ad7"><span class="section-number-3">15.3.</span> Blog-posts</h3>
<div class="outline-text-3" id="text-15-3">
<ul class="org-ul">
<li><a href="https://datatracker.ietf.org/doc/html/rfc1180">RFC 1180 - TCP/IP tutorial</a></li>
<li><a href="https://jameswillia.ms/posts/shortest-urls.html">Shortest URLs on the Internet | James Williams</a></li>
<li><a href="https://github.com/Raynos/topology">raynos/topology: Different network topologies</a></li>
<li><a href="https://developers.redhat.com/blog/2018/10/22/introduction-to-linux-interfaces-for-virtual-networking#">Introduction to Linux interfaces for virtual networking</a></li>
<li><a href="https://blog.apnic.net/2021/03/12/a-brief-history-of-router-architecture/">A brief history of router architecture | APNIC Blog</a></li>
<li><a href="https://engineering.atspotify.com/2016/01/sdn-internet-router-part-1/">SDN Internet Router – Part 1 : Spotify Engineering</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf955db8" class="outline-2">
<h2 id="orgf955db8"><span class="section-number-2">16.</span> Finance and Economics</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org39e7c25" class="outline-3">
<h3 id="org39e7c25"><span class="section-number-3">16.1.</span> Lectures</h3>
<div class="outline-text-3" id="text-16-1">
<ul class="org-ul">
<li><a href="https://pages.stern.nyu.edu/~adamodar/">A Damodaran Lectures</a></li>
<li><a href="https://www.khanacademy.org/economics-finance-domain/macroeconomics">Macroeconomics | Economics | Khan Academy</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4bc0174" class="outline-3">
<h3 id="org4bc0174"><span class="section-number-3">16.2.</span> Videos</h3>
<div class="outline-text-3" id="text-16-2">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=PHe0bXAIuk0">How The Economic Machine Works by Ray Dalio - YouTube</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6ebba28" class="outline-3">
<h3 id="org6ebba28"><span class="section-number-3">16.3.</span> Blog-posts</h3>
<div class="outline-text-3" id="text-16-3">
<ul class="org-ul">
<li><a href="https://steveblank.com/2022/09/20/mapping-the-unknown-the-ten-steps-to-map-any-industry/">Steve Blank Mapping the Unknown – The Ten Steps to Map Any Industry</a></li>
<li><a href="https://www.audiosciencereview.com/forum/index.php?threads%2Fsecrets-about-the-consumer-audio-business-you-may-find-interesting.37344%2F">&ldquo;Secrets&rdquo; about the consumer audio business you may find interesting</a></li>
<li><a href="https://steveblank.com/raising-money/">Steve Blank Raising Money</a></li>
<li><a href="https://thelastbearstanding.substack.com/p/origins-of-inflation?s=35">Origins of Inflation - The Last Bear Standing</a></li>
<li><a href="https://news.ycombinator.com/item?id=30657245">How did the gold standard work? | Hacker News</a></li>
<li><a href="https://www.tradingview.com/chart/DJI/VHAXD1rx-DOW-JONES/">DOW JONES for TVC:DJI by EXCAVO — TradingView</a></li>
<li><a href="https://www.investopedia.com/articles/investing/012315/how-demographics-drive-economy.asp">How Demographics Drive the Economy</a></li>
<li><a href="https://steveblank.com/secret-history/">Steve Blank Secret History</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgcb5fe7b" class="outline-3">
<h3 id="orgcb5fe7b"><span class="section-number-3">16.4.</span> Others</h3>
<div class="outline-text-3" id="text-16-4">
<ul class="org-ul">
<li><a href="https://start.edgeryders.eu/page/15452">Edgeryders | Start</a></li>
<li><a href="https://blog.bolt.io/hardware-team-prototyping/?s=35">Hardware by the Numbers (Part 1: Team + Prototyping) – The Bolt Blog</a></li>
<li><a href="https://blog.bolt.io/ideation/?s=35">The Illustrated Guide to Product Development (Part 1: Ideation) – The Bolt Blog</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc3bba70" class="outline-2">
<h2 id="orgc3bba70"><span class="section-number-2">17.</span> Computer Architecture</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-orge6eb1cb" class="outline-3">
<h3 id="orge6eb1cb"><span class="section-number-3">17.1.</span> Lectures</h3>
<div class="outline-text-3" id="text-17-1">
<ul class="org-ul">
<li><a href="https://computationstructures.org/index.html">computationstructures</a></li>
<li><a href="https://www.cs.cmu.edu/~213/schedule.html">15-213/15-513 Introduction to Computer Systems: Class Schedule</a></li>
<li><a href="https://www.coursera.org/learn/build-a-computer">Build a Modern Computer from First Principles: From Nand to Tetris</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org91915eb" class="outline-2">
<h2 id="org91915eb"><span class="section-number-2">18.</span> Operating Systems and Kernel</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-org8a6bb3e" class="outline-3">
<h3 id="org8a6bb3e"><span class="section-number-3">18.1.</span> Reading list</h3>
<div class="outline-text-3" id="text-18-1">
<ul class="org-ul">
<li><a href="https://github.com/gurugio/lowlevelprogramming-university">gurugio/lowlevelprogramming-university: How to be low-level programmer</a></li>
</ul>
</div>
</div>
<div id="outline-container-org36c56d0" class="outline-3">
<h3 id="org36c56d0"><span class="section-number-3">18.2.</span> Lectures</h3>
<div class="outline-text-3" id="text-18-2">
<ul class="org-ul">
<li><a href="https://www.cs.cmu.edu/~213/schedule.html">15-213/15-513 Introduction to Computer Systems: Class Schedule</a> (CSAPP Book)</li>
<li><a href="https://github.com/angrave/SystemProgramming/wiki">angrave/SystemProgramming Wiki</a></li>
<li>Virtualization
<ul class="org-ul">
<li><a href="https://github.com/Wenzel/awesome-virtualization">Wenzel/awesome-virtualization</a></li>
</ul></li>
</ul>
</div>
</div>
