assets/pages/syllabus.org
** Books
- [[https://www.goodreads.com/book/show/13192004-linux-kernel-development][Linux Kernel Development by Robert Love]]
- [[https://0xax.gitbooks.io/linux-insides/content/][Introduction &#xB7; Linux Inside]]
** Blog-posts
- filesystem
  - [[http://0pointer.net/blog/file-descriptor-limits.html][File Descriptor Limits]]
- System
  - [[https://blog.podman.io/2023/01/systemd-socket-activation-lesson-learned/][SystemD socket activation lesson learned]]
  - [[https://benhoyt.com/writings/io-is-no-longer-the-bottleneck/][I/O is no longer the bottleneck]]
  - [[https://news.ycombinator.com/item?id=33360830][How to write a bootloader from scratch (2019) | Hacker News]] 
  - [[https://cybergibbons.com/reverse-engineering-2/understanding-binary-and-data-representation-with-cyberchef/][Understanding Binary and Data Representation with CyberChef]]
  - [[https://utcc.utoronto.ca/~cks/space/blog/linux/LinuxBootOverview][Chris's Wiki :: blog/linux/LinuxBootOverview]]
  - [[https://www.youtube.com/watch?v=JRyrhsx-L5Y][Steven Rostedt - Learning the Linux Kernel with tracing]]
- Network
  - [[https://darkcoding.net/software/linux-what-can-you-epoll/][Linux: What can you epoll? · Graham King]]
  - [[https://cyounkins.medium.com/encrypted-dns-ntp-deadlock-9e378940b79f][Encrypted DNS + NTP = Deadlock.]]
- Linux Kernel
  - [[https://news.ycombinator.com/item?id=33174996][Anatomy of Linux Dynamic Libraries | Hacker News]]
  - [[https://gist.github.com/vegard/22200a9f91af138a99ae22a9b814a9a4][Getting started with Linux kernel development · GitHub]]
* [#B] Creative Programming
** Blog-posts
- [[https://news.ycombinator.com/item?id=33128495][How Ray Tracing works and how to do it faster {video} | Hacker News]]
- [[https://muffinman.io/blog/js-libraries-for-generative-art/][Libraries I use for generative art · Muffin Man]]
- [[https://raytracing.github.io/books/RayTracingInOneWeekend.html]]
- [[https://github.com/ssloy/tinyrenderer/wiki][Home · ssloy/tinyrenderer Wiki · GitHub]]
- [[https://github.com/anvaka/atree][GitHub - anvaka/atree: Just a simple Christmas tree, based on reddit story]]
- [[https://github.com/anvaka/e-sum][GitHub - anvaka/e-sum: Visualization of exponential sums]]
** Others
- [[https://drawingbots.net/][Drawingbots.net - Home]]
- [[https://img.ly/blog/ultimate-guide-to-ffmpeg/][FFmpeg - Ultimate Guide | IMG.LY Blog]]
- [[https://news.ycombinator.com/item?id=33363331][Pokemon Card Animation | Hacker News]]
** Reading lists
- [[https://github.com/blob42/awesome-explorables][GitHub - blob42/awesome-explorables]]
- [[https://github.com/raphamorim/awesome-canvas][A curated list of awesome HTML5 Canvas with examples, related articles and posts.]]
- [[https://github.com/sergey-pimenov/awesome-web-animation][A list of awesome web animation libraries, books, apps etc.]]
** Courses
- [[https://generativeartistry.com/][Generative Artistry]]
- [[https://news.ycombinator.com/item?id=34556309][Creative coding, making loops with Processing | Hacker News]]
- [[https://www.youtube.com/playlist?app=desktop&list=PLqCJpWy5Fohe8ucwhksiv9hTF5sfid8lA][3D Programming Fundamentals - YouTube]]  (Course)
** Tools
- [[https://www.babylonjs.com/][Babylon.js: Powerful, Beautiful, Simple, Open - Web-Based 3D At Its Best]]
* [#B] Archival
** Blog-posts
- [[https://github.com/kensanata/mastodon-archive][GitHub - kensanata/mastodon-archive: Archive your statuses]]
- [[https://news.ycombinator.com/item?id=35102318][Saving 4M books from landfill | Hacker News]]
- [[https://annas-blog.org/how-to-run-a-shadow-library.html][How to run a shadow library: operations at Anna’s Archive - Anna’s Blog]]
- [[http://ascii.textfiles.com/archives/5443][Archiving in the Time of Streaming « ASCII by Jason Scott]]
- [[https://news.ycombinator.com/item?id=35468753][If we lose the Internet Archive, we’re screwed | Hacker News]]
- [[https://news.ycombinator.com/item?id=33254791][Lost something? Search through 91.7M files from the 80s, 90s, and 2000s]]
- [[https://news.ycombinator.com/item?id=33274186][The Overflow Offline project | Hacker News]]
- [[https://news.ycombinator.com/item?id=33320294][Forgetting the Asbestos – how we lose knowledge and technologies | Hacker News]]
- [[https://www.cjr.org/business_of_news/archiving-official-documents-as-an-act-of-radical-journalism.php][Archiving official documents as an act of radical journalism - Columbia Journ...]]
- [[https://news.ycombinator.com/item?id=33919823][Internet Archive Scholar | Hacker News]]
- [[https://news.ycombinator.com/item?id=32662026][Ask HN: How do you plan to archive all your digital content? | Hacker News]]
- [[https://news.ycombinator.com/item?id=28003119][How I store my files | Hacker News]]
- [[https://news.ycombinator.com/item?id=30527999][SingleFile: Save a complete web page into a single HTML file | Hacker News]]
- SCI HUB
  - [[https://news.ycombinator.com/item?id=34541505][Sci-Hub: knowledge as a human right | Hacker News]]
  - https://www.reddit.com/r/DataHoarder/comments/nc27fv/rescue_mission_for_scihub_and_open_science_we_are/
  - https://en.wikipedia.org/wiki/Sci-Hub#cite_note-:12-31
  - https://en.wikipedia.org/wiki/Anna%27s_Archive
  - https://gizmodo.com/archivists-want-to-make-sci-hub-un-censorable-1846898276
** Reading lists
- https://github.com/simon987/awesome-datahoarding
- [[https://ethics-law.archives.ncbs.res.in/docs/intro][Introduction | Archives, Ethics and the Law in India]]  by Farah Yameen and Divij Joshi
- [[https://publish.obsidian.md/swyx/R+-+Product/Automation+Notes][Automation Notes - swyx's second brain - Obsidian Publish]] (https://archive.is/PC9if)
* General Software Engineering
