static/syllabus.html
<div id="outline-container-orgc713216" class="outline-3">
<h3 id="orgc713216"><span class="section-number-3">18.3.</span> Books</h3>
<div class="outline-text-3" id="text-18-3">
<ul class="org-ul">
<li><a href="https://www.goodreads.com/book/show/13192004-linux-kernel-development">Linux Kernel Development by Robert Love</a></li>
<li><a href="https://0xax.gitbooks.io/linux-insides/content/">Introduction &amp;#xB7; Linux Inside</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd81a3cd" class="outline-3">
<h3 id="orgd81a3cd"><span class="section-number-3">18.4.</span> Blog-posts</h3>
<div class="outline-text-3" id="text-18-4">
<ul class="org-ul">
<li>filesystem
<ul class="org-ul">
<li><a href="http://0pointer.net/blog/file-descriptor-limits.html">File Descriptor Limits</a></li>
</ul></li>
<li>System
<ul class="org-ul">
<li><a href="https://blog.podman.io/2023/01/systemd-socket-activation-lesson-learned/">SystemD socket activation lesson learned</a></li>
<li><a href="https://benhoyt.com/writings/io-is-no-longer-the-bottleneck/">I/O is no longer the bottleneck</a></li>
<li><a href="https://news.ycombinator.com/item?id=33360830">How to write a bootloader from scratch (2019) | Hacker News</a></li>
<li><a href="https://cybergibbons.com/reverse-engineering-2/understanding-binary-and-data-representation-with-cyberchef/">Understanding Binary and Data Representation with CyberChef</a></li>
<li id="[[<a href="https://utcc.utoronto.ca/~cks/space/blog/linux/LinuxBootOverview">https://utcc.utoronto.ca/~cks/space/blog/linux/LinuxBootOverview</a>][Chris&rsquo;s Wiki">blog/linux/LinuxBootOverview]]</li>
<li><a href="https://www.youtube.com/watch?v=JRyrhsx-L5Y">Steven Rostedt - Learning the Linux Kernel with tracing</a></li>
</ul></li>
<li>Network
<ul class="org-ul">
<li><a href="https://darkcoding.net/software/linux-what-can-you-epoll/">Linux: What can you epoll? · Graham King</a></li>
<li><a href="https://cyounkins.medium.com/encrypted-dns-ntp-deadlock-9e378940b79f">Encrypted DNS + NTP = Deadlock.</a></li>
</ul></li>
<li>Linux Kernel
<ul class="org-ul">
<li><a href="https://news.ycombinator.com/item?id=33174996">Anatomy of Linux Dynamic Libraries | Hacker News</a></li>
<li><a href="https://gist.github.com/vegard/22200a9f91af138a99ae22a9b814a9a4">Getting started with Linux kernel development · GitHub</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1df9ca2" class="outline-2">
<h2 id="org1df9ca2"><span class="section-number-2">19.</span> Creative Programming</h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-orge6c5f6a" class="outline-3">
<h3 id="orge6c5f6a"><span class="section-number-3">19.1.</span> Blog-posts</h3>
<div class="outline-text-3" id="text-19-1">
<ul class="org-ul">
<li><a href="https://news.ycombinator.com/item?id=33128495">How Ray Tracing works and how to do it faster {video} | Hacker News</a></li>
<li><a href="https://muffinman.io/blog/js-libraries-for-generative-art/">Libraries I use for generative art · Muffin Man</a></li>
<li><a href="https://raytracing.github.io/books/RayTracingInOneWeekend.html">https://raytracing.github.io/books/RayTracingInOneWeekend.html</a></li>
<li><a href="https://github.com/ssloy/tinyrenderer/wiki">Home · ssloy/tinyrenderer Wiki · GitHub</a></li>
<li><a href="https://github.com/anvaka/atree">GitHub - anvaka/atree: Just a simple Christmas tree, based on reddit story</a></li>
<li><a href="https://github.com/anvaka/e-sum">GitHub - anvaka/e-sum: Visualization of exponential sums</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7b6d4dd" class="outline-3">
<h3 id="org7b6d4dd"><span class="section-number-3">19.2.</span> Others</h3>
<div class="outline-text-3" id="text-19-2">
<ul class="org-ul">
<li><a href="https://drawingbots.net/">Drawingbots.net - Home</a></li>
<li><a href="https://img.ly/blog/ultimate-guide-to-ffmpeg/">FFmpeg - Ultimate Guide | IMG.LY Blog</a></li>
<li><a href="https://news.ycombinator.com/item?id=33363331">Pokemon Card Animation | Hacker News</a></li>
</ul>
</div>
</div>
<div id="outline-container-org690dd0d" class="outline-3">
<h3 id="org690dd0d"><span class="section-number-3">19.3.</span> Reading lists</h3>
<div class="outline-text-3" id="text-19-3">
<ul class="org-ul">
<li><a href="https://github.com/blob42/awesome-explorables">GitHub - blob42/awesome-explorables</a></li>
<li><a href="https://github.com/raphamorim/awesome-canvas">A curated list of awesome HTML5 Canvas with examples, related articles and posts.</a></li>
<li><a href="https://github.com/sergey-pimenov/awesome-web-animation">A list of awesome web animation libraries, books, apps etc.</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1d30b60" class="outline-3">
<h3 id="org1d30b60"><span class="section-number-3">19.4.</span> Courses</h3>
<div class="outline-text-3" id="text-19-4">
<ul class="org-ul">
<li><a href="https://generativeartistry.com/">Generative Artistry</a></li>
<li><a href="https://news.ycombinator.com/item?id=34556309">Creative coding, making loops with Processing | Hacker News</a></li>
<li><a href="https://www.youtube.com/playlist?app=desktop&amp;list=PLqCJpWy5Fohe8ucwhksiv9hTF5sfid8lA">3D Programming Fundamentals - YouTube</a>  (Course)</li>
</ul>
</div>
</div>
<div id="outline-container-orgc81cbb5" class="outline-3">
<h3 id="orgc81cbb5"><span class="section-number-3">19.5.</span> Tools</h3>
<div class="outline-text-3" id="text-19-5">
<ul class="org-ul">
<li><a href="https://www.babylonjs.com/">Babylon.js: Powerful, Beautiful, Simple, Open - Web-Based 3D At Its Best</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6962b8a" class="outline-2">
<h2 id="org6962b8a"><span class="section-number-2">20.</span> Archival</h2>
<div class="outline-text-2" id="text-20">
</div>
<div id="outline-container-org6042e2a" class="outline-3">
<h3 id="org6042e2a"><span class="section-number-3">20.1.</span> Blog-posts</h3>
<div class="outline-text-3" id="text-20-1">
<ul class="org-ul">
<li><a href="https://github.com/kensanata/mastodon-archive">GitHub - kensanata/mastodon-archive: Archive your statuses</a></li>
<li><a href="https://news.ycombinator.com/item?id=35102318">Saving 4M books from landfill | Hacker News</a></li>
<li><a href="http://ascii.textfiles.com/archives/5443">Archiving in the Time of Streaming « ASCII by Jason Scott</a></li>
<li><a href="https://news.ycombinator.com/item?id=33254791">Lost something? Search through 91.7M files from the 80s, 90s, and 2000s</a></li>
<li><a href="https://news.ycombinator.com/item?id=33274186">The Overflow Offline project | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=33320294">Forgetting the Asbestos – how we lose knowledge and technologies | Hacker News</a></li>
<li><a href="https://www.cjr.org/business_of_news/archiving-official-documents-as-an-act-of-radical-journalism.php">Archiving official documents as an act of radical journalism - Columbia Journ&#x2026;</a></li>
<li><a href="https://news.ycombinator.com/item?id=33919823">Internet Archive Scholar | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=32662026">Ask HN: How do you plan to archive all your digital content? | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=28003119">How I store my files | Hacker News</a></li>
<li><a href="https://news.ycombinator.com/item?id=30527999">SingleFile: Save a complete web page into a single HTML file | Hacker News</a></li>
<li>SCI HUB
<ul class="org-ul">
<li><a href="https://news.ycombinator.com/item?id=34541505">Sci-Hub: knowledge as a human right | Hacker News</a></li>
<li><a href="https://www.reddit.com/r/DataHoarder/comments/nc27fv/rescue_mission_for_scihub_and_open_science_we_are/">https://www.reddit.com/r/DataHoarder/comments/nc27fv/rescue_mission_for_scihub_and_open_science_we_are/</a></li>
<li><a href="https://en.wikipedia.org/wiki/Sci-Hub#cite_note-:12-31">https://en.wikipedia.org/wiki/Sci-Hub#cite_note-:12-31</a></li>
<li><a href="https://en.wikipedia.org/wiki/Anna%27s_Archive">https://en.wikipedia.org/wiki/Anna%27s_Archive</a></li>
<li><a href="https://gizmodo.com/archivists-want-to-make-sci-hub-un-censorable-1846898276">https://gizmodo.com/archivists-want-to-make-sci-hub-un-censorable-1846898276</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org59a36eb" class="outline-3">
<h3 id="org59a36eb"><span class="section-number-3">20.2.</span> Reading lists</h3>
<div class="outline-text-3" id="text-20-2">
<ul class="org-ul">
<li><a href="https://github.com/simon987/awesome-datahoarding">https://github.com/simon987/awesome-datahoarding</a></li>
<li><a href="https://ethics-law.archives.ncbs.res.in/docs/intro">Introduction | Archives, Ethics and the Law in India</a>  by Farah Yameen and Divij Joshi</li>
<li><a href="https://publish.obsidian.md/swyx/R+-+Product/Automation+Notes">Automation Notes - swyx&rsquo;s second brain - Obsidian Publish</a> (<a href="https://archive.is/PC9if">https://archive.is/PC9if</a>)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3640cc0" class="outline-2">
<h2 id="org3640cc0"><span class="section-number-2">21.</span> General Software Engineering</h2>
<div class="outline-text-2" id="text-21">
</div>
