assets/pages/syllabus.org
** Meta
- [[https://venam.nixers.net/blog/programming/2020/01/09/se-practices.html][Professional Software Engineering Topics And Practices]]
- [[https://addyosmani.com/blog/software-engineering-soft-parts/][AddyOsmani.com - Software Engineering - The Soft Parts]]
- [[https://bytes.zone/posts/advice-you-might-as-well-take/][advice you might as well take]]
- [[https://www.reddit.com/r/programming/comments/i6wex0/it_never_gets_easier_you_just_go_faster/][“It never gets easier, you just go faster.”]]
- [[https://vickiboykis.com/2022/12/05/the-cloudy-layers-of-modern-day-programming/][The cloudy layers of modern-day programming | ★❤✰ Vicki Boykis ★❤✰]]
- [[https://www.ufried.com/blog/continuous_amnesia_issue/][The continuous amnesia issue]]
- [[https://jvns.ca/blog/2022/03/13/celebrate-tiny-learning-milestones/][Celebrate tiny learning milestones]]
- [[https://www.simplethread.com/20-things-ive-learned-in-my-20-years-as-a-software-engineer/][20 Things I've Learned in my 20 Years as a Software Engineer - Simple Thread]]
** Tactical
- [[https://www.jeremyong.com/game%20engines/2023/01/25/grokking-big-unfamiliar-codebases/][Grokking Big Unfamiliar Codebases – Jeremy's Blog]]
- [[https://zwischenzugs.com/2021/03/15/when-should-i-interrupt-someone/][When Should I Interrupt Someone? – zwischenzugs]]
- [[https://fiatjaf.com/b634a4d8.html][There’s a problem with using Git concepts for everything – fiatjaf]]
- [[https://davesmithhayes.com/posts/2022/12/project-requirements/][Project Requirements: Why They Matter]]
- [[https://obdurodon.silvrback.com/navigating-a-large-codebase][Jeff Darcy - Navigating a Large Codebase]]
- [[https://simonwillison.net/2022/Oct/29/the-perfect-commit/][The Perfect Commit]]
- [[https://tylercipriani.com/blog/2022/03/12/code-review-procrastination-and-clarity/][Code Review Decision Fatigue - Tyler Cipriani]]
- [[https://mitchellh.com/writing/contributing-to-complex-projects][Contributing to Complex Projects – Mitchell Hashimoto]]
- [[https://www.brendangregg.com/blog/2022-03-19/why-dont-you-use.html][Why Don't You Use ...]]
- [[https://www.iamjonas.me/2020/08/how-to-read-code.html][I am Jonas: How to read a code]]
- [[https://www.willett.io/posts/precepts/][How to Build Software like an SRE — willett dot io]]
- [[https://abdullin.com/beautiful-tech-debt/][Beautiful technical debt]]
** Engineering Management
- [[https://hoho.com/posts/your-stack-is-not-the-product/][Your tech stack is not the product | hoho.com]]
- [[https://news.ycombinator.com/item?id=34957523][DIB Guide: Detecting Agile BS (2018) {pdf} | Hacker News]]
- [[https://blog.codeberg.org/the-hardest-scaling-issue.html][Hardest scaling issues]]
- [[https://c4model.com/][The C4 model for visualising software architecture]]
- [[https://bevyengine.org/news/scaling-bevy-development/][Bevy - Scaling Bevy Development]]
- [[https://github.com/jorgef/engineeringladders][jorgef/engineeringladders: A framework for Engineering Managers]]
- [[https://klinger.io/posts/managing-people-%F0%9F%A4%AF][Managing people 🤯 | Andreas Klinger]]
- [[https://blog.ignaciobrasca.com/opinion/2022/01/08/bosses-and-bad-ideas.html][Bosses and Bad Ideas: a tale from corporate software | Ignacio Brasca - DevBlog]]
- [[https://engineeringorg.substack.com/p/how-to-not-be-a-micro-manager-part][How To Not Be A Micro Manager - Part 1 - by svs]]
- [[https://www.spakhm.com/p/parallel-tracks][Parallel tracks - by Slava Akhmechet - Zero Credibility]]
- [[https://staffeng.com/][Stories of reaching Staff-plus engineering roles - StaffEng | StaffEng]]
- [[https://jacobian.org/2022/jun/17/dora-metrics/][DORA Metrics: the Right Answer to measuring engineering team performance]]
** Freelancing
- [[https://relevant.software/blog/the-documents-in-software-development-outsourcing-you-absolutely-have-to-know-about/][Documents in Software Development 2021 {You Have to Know About}]]
** Process
- [[https://steinkamp.us/post/2022/11/10/what-i-learned-at-stripe.html][What I Learned At Stripe | steinkamp.us]]
- [[https://blog.pragmaticengineer.com/data-structures-and-algorithms-i-actually-used-day-to-day/][Data Structures & Algorithms I Used Working at Tech Companies]]
- [[https://netflixtechblog.com/full-cycle-developers-at-netflix-a08c31f83249][Full Cycle Developers at Netflix — Operate What You Build]]
- [[https://martinfowler.com/articles/on-pair-programming.html][On Pair Programming]]
** Interviews and Job market
- [[https://jmmv.dev/2021/04/always-be-quitting.html][Always be quitting - Julio Merino (jmmv.dev)]]
- [[https://brandonoxendine.com/writing/how-to-onboard-designers][How to Onboard Designers — Brandon Oxendine]]
- [[https://thenewstack.io/diary-of-a-first-time-on-call-engineer/][Diary of a First-Time On-Call Engineer - The New Stack]]
- [[https://stitcher.io/blog/dont-get-stuck][Don't get stuck - stitcher.io]]
- [[https://amyunger.com/blog/2020/09/10/staff-engineer-at-heroku.html][How I operated as a Staff engineer at Heroku]]
- [[https://rachelbythebay.com/w/2020/05/22/boarded/][Just some red flags. No big deal. Just ignore them.]]
** Handbooks/Resources
- [[https://archive.is/JZsbv][Agora - The Center of Compensation]]
- [[https://github.com/workos/awesome-developer-experience][workos/awesome-developer-experience]]
- [[https://github.com/alicegoldfuss/oncall-handbook][alicegoldfuss/oncall-handbook]]
- [[https://github.com/ksindi/managers-playbook][ksindi/managers-playbook]]
- [[https://github.com/PeterCookDev/TechLeading][PeterCookDev/TechLeading: Resources for tech leads]]
** Software research
- [[https://venam.nixers.net/blog/unix/2020/03/29/distro-pkgs.html][Software Distributions And Their Roles Today]]
- [[https://orbit.love/blog/software-is-no-longer-sold-its-adopted][Software is no longer sold; it&#x27;s adopted - Orbit]]
- [[https://github.com/chainguard-dev/ssc-reading-list][chainguard-dev/ssc-reading-list]]
- [[https://neverworkintheory.org/2022/08/30/software-engineering-research-questions.html][Software Engineering Research Questions · It Will Never Work in Theory]]
* Embedded systems and Radio
- [ ] [[https://pico-doc.synack.me/][Ada on the Raspberry Pi Pico]]
- [ ] [[https://news.ycombinator.com/item?id=34562256][What are some interesting uses of WebUSB you have come across? | Hacker News]]
- [ ] [[https://blues.io/blog/raspberry-pi-pico-pio/][A Practical Look at PIO on the Raspberry Pi Pico | Blues Wireless]]
- [ ] [[https://learn.adacore.com/courses/intro-to-embedded-sys-prog/index.html][Introduction to Embedded Systems Programming — learn.adacore.com]]
