static/syllabus.html
<div id="outline-container-org7771007" class="outline-3">
<h3 id="org7771007"><span class="section-number-3">21.1.</span> Meta</h3>
<div class="outline-text-3" id="text-21-1">
<ul class="org-ul">
<li><a href="https://venam.nixers.net/blog/programming/2020/01/09/se-practices.html">Professional Software Engineering Topics And Practices</a></li>
<li><a href="https://addyosmani.com/blog/software-engineering-soft-parts/">AddyOsmani.com - Software Engineering - The Soft Parts</a></li>
<li><a href="https://bytes.zone/posts/advice-you-might-as-well-take/">advice you might as well take</a></li>
<li><a href="https://www.reddit.com/r/programming/comments/i6wex0/it_never_gets_easier_you_just_go_faster/">“It never gets easier, you just go faster.”</a></li>
<li><a href="https://vickiboykis.com/2022/12/05/the-cloudy-layers-of-modern-day-programming/">The cloudy layers of modern-day programming | ★❤✰ Vicki Boykis ★❤✰</a></li>
<li><a href="https://www.ufried.com/blog/continuous_amnesia_issue/">The continuous amnesia issue</a></li>
<li><a href="https://jvns.ca/blog/2022/03/13/celebrate-tiny-learning-milestones/">Celebrate tiny learning milestones</a></li>
<li><a href="https://www.simplethread.com/20-things-ive-learned-in-my-20-years-as-a-software-engineer/">20 Things I&rsquo;ve Learned in my 20 Years as a Software Engineer - Simple Thread</a></li>
</ul>
</div>
</div>
<div id="outline-container-org31949ac" class="outline-3">
<h3 id="org31949ac"><span class="section-number-3">21.2.</span> Tactical</h3>
<div class="outline-text-3" id="text-21-2">
<ul class="org-ul">
<li><a href="https://www.jeremyong.com/game%20engines/2023/01/25/grokking-big-unfamiliar-codebases/">Grokking Big Unfamiliar Codebases – Jeremy&rsquo;s Blog</a></li>
<li><a href="https://zwischenzugs.com/2021/03/15/when-should-i-interrupt-someone/">When Should I Interrupt Someone? – zwischenzugs</a></li>
<li><a href="https://fiatjaf.com/b634a4d8.html">There’s a problem with using Git concepts for everything – fiatjaf</a></li>
<li><a href="https://davesmithhayes.com/posts/2022/12/project-requirements/">Project Requirements: Why They Matter</a></li>
<li><a href="https://obdurodon.silvrback.com/navigating-a-large-codebase">Jeff Darcy - Navigating a Large Codebase</a></li>
<li><a href="https://simonwillison.net/2022/Oct/29/the-perfect-commit/">The Perfect Commit</a></li>
<li><a href="https://tylercipriani.com/blog/2022/03/12/code-review-procrastination-and-clarity/">Code Review Decision Fatigue - Tyler Cipriani</a></li>
<li><a href="https://mitchellh.com/writing/contributing-to-complex-projects">Contributing to Complex Projects – Mitchell Hashimoto</a></li>
<li><a href="https://www.brendangregg.com/blog/2022-03-19/why-dont-you-use.html">Why Don&rsquo;t You Use &#x2026;</a></li>
<li><a href="https://www.iamjonas.me/2020/08/how-to-read-code.html">I am Jonas: How to read a code</a></li>
<li><a href="https://www.willett.io/posts/precepts/">How to Build Software like an SRE — willett dot io</a></li>
<li><a href="https://abdullin.com/beautiful-tech-debt/">Beautiful technical debt</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1c2bc7d" class="outline-3">
<h3 id="org1c2bc7d"><span class="section-number-3">21.3.</span> Engineering Management</h3>
<div class="outline-text-3" id="text-21-3">
<ul class="org-ul">
<li><a href="https://hoho.com/posts/your-stack-is-not-the-product/">Your tech stack is not the product | hoho.com</a></li>
<li><a href="https://news.ycombinator.com/item?id=34957523">DIB Guide: Detecting Agile BS (2018) {pdf} | Hacker News</a></li>
<li><a href="https://blog.codeberg.org/the-hardest-scaling-issue.html">Hardest scaling issues</a></li>
<li><a href="https://c4model.com/">The C4 model for visualising software architecture</a></li>
<li><a href="https://bevyengine.org/news/scaling-bevy-development/">Bevy - Scaling Bevy Development</a></li>
<li><a href="https://github.com/jorgef/engineeringladders">jorgef/engineeringladders: A framework for Engineering Managers</a></li>
<li><a href="https://klinger.io/posts/managing-people-%F0%9F%A4%AF">Managing people 🤯 | Andreas Klinger</a></li>
<li><a href="https://blog.ignaciobrasca.com/opinion/2022/01/08/bosses-and-bad-ideas.html">Bosses and Bad Ideas: a tale from corporate software | Ignacio Brasca - DevBlog</a></li>
<li><a href="https://engineeringorg.substack.com/p/how-to-not-be-a-micro-manager-part">How To Not Be A Micro Manager - Part 1 - by svs</a></li>
<li><a href="https://www.spakhm.com/p/parallel-tracks">Parallel tracks - by Slava Akhmechet - Zero Credibility</a></li>
<li><a href="https://staffeng.com/">Stories of reaching Staff-plus engineering roles - StaffEng | StaffEng</a></li>
<li><a href="https://jacobian.org/2022/jun/17/dora-metrics/">DORA Metrics: the Right Answer to measuring engineering team performance</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0e3a692" class="outline-3">
<h3 id="org0e3a692"><span class="section-number-3">21.4.</span> Freelancing</h3>
<div class="outline-text-3" id="text-21-4">
<ul class="org-ul">
<li><a href="https://relevant.software/blog/the-documents-in-software-development-outsourcing-you-absolutely-have-to-know-about/">Documents in Software Development 2021 {You Have to Know About}</a></li>
</ul>
</div>
</div>
<div id="outline-container-org578a8d9" class="outline-3">
<h3 id="org578a8d9"><span class="section-number-3">21.5.</span> Process</h3>
<div class="outline-text-3" id="text-21-5">
<ul class="org-ul">
<li><a href="https://steinkamp.us/post/2022/11/10/what-i-learned-at-stripe.html">What I Learned At Stripe | steinkamp.us</a></li>
<li><a href="https://blog.pragmaticengineer.com/data-structures-and-algorithms-i-actually-used-day-to-day/">Data Structures &amp; Algorithms I Used Working at Tech Companies</a></li>
<li><a href="https://netflixtechblog.com/full-cycle-developers-at-netflix-a08c31f83249">Full Cycle Developers at Netflix — Operate What You Build</a></li>
<li><a href="https://martinfowler.com/articles/on-pair-programming.html">On Pair Programming</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6e6e66c" class="outline-3">
<h3 id="org6e6e66c"><span class="section-number-3">21.6.</span> Interviews and Job market</h3>
<div class="outline-text-3" id="text-21-6">
<ul class="org-ul">
<li><a href="https://jmmv.dev/2021/04/always-be-quitting.html">Always be quitting - Julio Merino (jmmv.dev)</a></li>
<li><a href="https://brandonoxendine.com/writing/how-to-onboard-designers">How to Onboard Designers — Brandon Oxendine</a></li>
<li><a href="https://thenewstack.io/diary-of-a-first-time-on-call-engineer/">Diary of a First-Time On-Call Engineer - The New Stack</a></li>
<li><a href="https://stitcher.io/blog/dont-get-stuck">Don&rsquo;t get stuck - stitcher.io</a></li>
<li><a href="https://amyunger.com/blog/2020/09/10/staff-engineer-at-heroku.html">How I operated as a Staff engineer at Heroku</a></li>
<li><a href="https://rachelbythebay.com/w/2020/05/22/boarded/">Just some red flags. No big deal. Just ignore them.</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc7c9dc9" class="outline-3">
<h3 id="orgc7c9dc9"><span class="section-number-3">21.7.</span> Handbooks/Resources</h3>
<div class="outline-text-3" id="text-21-7">
<ul class="org-ul">
<li><a href="https://archive.is/JZsbv">Agora - The Center of Compensation</a></li>
<li><a href="https://github.com/workos/awesome-developer-experience">workos/awesome-developer-experience</a></li>
<li><a href="https://github.com/alicegoldfuss/oncall-handbook">alicegoldfuss/oncall-handbook</a></li>
<li><a href="https://github.com/ksindi/managers-playbook">ksindi/managers-playbook</a></li>
<li><a href="https://github.com/PeterCookDev/TechLeading">PeterCookDev/TechLeading: Resources for tech leads</a></li>
</ul>
</div>
</div>
<div id="outline-container-org32fc033" class="outline-3">
<h3 id="org32fc033"><span class="section-number-3">21.8.</span> Software research</h3>
<div class="outline-text-3" id="text-21-8">
<ul class="org-ul">
<li><a href="https://venam.nixers.net/blog/unix/2020/03/29/distro-pkgs.html">Software Distributions And Their Roles Today</a></li>
<li><a href="https://orbit.love/blog/software-is-no-longer-sold-its-adopted">Software is no longer sold; it&amp;#x27;s adopted - Orbit</a></li>
<li><a href="https://github.com/chainguard-dev/ssc-reading-list">chainguard-dev/ssc-reading-list</a></li>
<li><a href="https://neverworkintheory.org/2022/08/30/software-engineering-research-questions.html">Software Engineering Research Questions · It Will Never Work in Theory</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2fe01f5" class="outline-2">
<h2 id="org2fe01f5"><span class="section-number-2">22.</span> Embedded systems and Radio</h2>
<div class="outline-text-2" id="text-22">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <a href="https://pico-doc.synack.me/">Ada on the Raspberry Pi Pico</a></li>
<li class="off"><code>[&#xa0;]</code> <a href="https://news.ycombinator.com/item?id=34562256">What are some interesting uses of WebUSB you have come across? | Hacker News</a></li>
<li class="off"><code>[&#xa0;]</code> <a href="https://learn.adacore.com/courses/intro-to-embedded-sys-prog/index.html">Introduction to Embedded Systems Programming — learn.adacore.com</a></li>
</ul>
</div>
